-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Jul 03, 2026 at 01:35 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `charshanbe_jalase`
--

-- --------------------------------------------------------

--
-- Table structure for table `archive_logs`
--

CREATE TABLE `archive_logs` (
  `id` int(11) NOT NULL,
  `log_date` varchar(20) NOT NULL,
  `log_type` varchar(50) NOT NULL,
  `title` varchar(255) NOT NULL,
  `details_json` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `archive_logs`
--

INSERT INTO `archive_logs` (`id`, `log_date`, `log_type`, `title`, `details_json`, `created_at`) VALUES
(1, '1404/11/01', 'grouping', 'براساس تاریخ تولد', '{\"isMultiGroup\":true,\"groups\":[{\"name\":\"گروه دو\",\"members\":[\"علی مجردی\",\"پرهام ژیان\",\"سجاد فدایی\"]},{\"name\":\"گروه یک\",\"members\":[\"عماد رضایی\",\"محمد مهدی امین فر\",\"امیر علی صمدی\"]}]}', '2026-04-29 12:50:05'),
(2, '1404/11/08', 'free_activity', 'علت و داستان صلوات قبل و بعد از دعا', 'داستان بال های پرنده و بال های دعا( قبل و بعد دعا دعایی کنیم که میدونیم مستجابه)', '2026-04-29 12:50:05'),
(3, '1404/11/08', 'grouping', 'بر اساس قد', '{\"isMultiGroup\":true,\"groups\":[{\"name\":\"گروه بی عینک ها بجز امیرعلی\",\"members\":[\"علی مجردی\",\"محمد مهدی امین فر\",\"امیر علی صمدی\",\"مهدیار شکوری\"]},{\"name\":\"گروه بی عینک ها بجز پرهام\",\"members\":[\"عماد رضایی\",\"پرهام رجبی پور\",\"محمد صالح میری\",\"سجاد فدایی\",\"محمدطاها هدایتی\"]}]}', '2026-04-29 12:50:05'),
(4, '1404/11/14', 'free_activity', 'جشن نیمه شعبان', '', '2026-04-29 12:50:05'),
(5, '1404/11/29', 'grouping', 'گروه بندی بر اساس لباس', '{\"isMultiGroup\":true,\"groups\":[{\"name\":\"کسایی که تو لباسشون رنگ زرد و نارنجی داشتن \",\"members\":[\"امیر علی صمدی\",\"پرهام رجبی پور\",\"مهدیار شکوری\",\"سجاد فدایی\"]},{\"name\":\"کسایی که اون رنگ رو ندارن\",\"members\":[\"علی مجردی\",\"محمد مهدی امین فر\",\"محمد صالح میری\",\"مهدی یار خاطریان\"]}]}', '2026-04-29 12:50:05'),
(6, '1404/12/01', 'grouping', 'تیم های فوتسال', '{\"isMultiGroup\":true,\"groups\":[{\"name\":\"گروه اقای بهمن ابادی\",\"members\":[\"علی مجردی\",\"پرهام رجبی پور\",\"مهدیار شکوری\",\"ابوالفضل مکی\"]},{\"name\":\"گرمه اقای زمانیان \",\"members\":[\"محمد مهدی امین فر\",\"امیر علی صمدی\",\"محمد صالح میری\",\"مهدی یار خاطریان\"]}]}', '2026-04-29 12:50:05'),
(7, '1404/12/06', 'grouping', 'هرکس که خواهر و یا برادر بزرگ تر داره', '{\"isMultiGroup\":true,\"groups\":[{\"name\":\"گروه خواهر برادر بزرگ تر دارن\",\"members\":[\"عماد رضایی\",\"علی مجردی\",\"محمد مهدی امین فر\",\"محمد صالح میری\",\"سجاد فدایی\",\"ابوالفضل مکی\"]},{\"name\":\"اونایی ک بزرگ تر ندارن \",\"members\":[\"پرهام رجبی پور\",\"مهدی یار خاطریان\",\"مهدیار شکوری\",\"محمد مهدوی فر\"]}]}', '2026-04-29 12:50:05'),
(8, '1405/01/19', 'free_activity', 'نکات نماز گفته شده', 'جلسه اول ماه رمضون \nرو برنگردوندن از قبله\n\nجلسه دوم \nدست موقع سجده\n\nجلسه سوم ماه رمضون\nتکبیر بلند گفتن\n\nجلسه اول سال ۱۴۰۵ \nخم شدن در رکوع', '2026-04-29 12:50:05');

-- --------------------------------------------------------

--
-- Table structure for table `attendance_records`
--

CREATE TABLE `attendance_records` (
  `id` int(11) NOT NULL,
  `session_id` int(11) NOT NULL,
  `student_id` int(11) NOT NULL,
  `status` varchar(20) NOT NULL,
  `late_minutes` int(11) NOT NULL DEFAULT 0,
  `status_text` varchar(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `attendance_records`
--

INSERT INTO `attendance_records` (`id`, `session_id`, `student_id`, `status`, `late_minutes`, `status_text`) VALUES
(1, 1, 1, 'Present', 0, 'حاضر'),
(2, 2, 1, 'Absent', 0, 'غیبت'),
(3, 3, 1, 'Present', 0, 'حاضر'),
(4, 4, 1, 'Present', 0, 'حاضر'),
(5, 5, 1, 'Present', 0, 'حاضر'),
(6, 6, 1, 'Present', 0, 'حاضر'),
(7, 7, 1, 'Absent', 0, 'غیبت'),
(8, 8, 1, 'Present', 0, 'حاضر'),
(9, 9, 1, 'Present', 0, 'حاضر'),
(10, 10, 1, 'Late', 7, 'تاخیر (7 دقیقه)'),
(11, 11, 1, 'Absent', 0, 'غیبت'),
(12, 12, 1, 'Present', 0, 'حاضر'),
(13, 13, 1, 'Present', 0, 'حاضر'),
(14, 14, 1, 'Present', 0, 'حاضر'),
(15, 15, 1, 'Late', 21, 'تاخیر (۲۱ دقیقه)'),
(17, 17, 1, 'Late', 5, 'تاخیر (5 دقیقه)'),
(18, 18, 1, 'Present', 0, 'حاضر'),
(19, 19, 1, 'Late', 21, 'تاخیر (21 دقیقه)'),
(20, 20, 1, 'Present', 0, 'حاضر'),
(22, 22, 1, 'Late', 16, 'تاخیر (16 دقیقه)'),
(23, 1, 2, 'Present', 0, 'حاضر'),
(24, 2, 2, 'Absent', 0, 'غیبت'),
(25, 3, 2, 'Present', 0, 'حاضر'),
(26, 4, 2, 'Present', 0, 'حاضر'),
(27, 5, 2, 'Present', 0, 'حاضر'),
(28, 6, 2, 'Late', 10, 'تاخیر (10)'),
(29, 7, 2, 'Present', 0, 'حاضر'),
(30, 8, 2, 'Present', 0, 'حاضر'),
(31, 9, 2, 'Present', 0, 'حاضر'),
(32, 10, 2, 'Present', 0, 'حاضر'),
(33, 11, 2, 'Late', 5, 'تاخیر (۵ دقیقه)'),
(34, 12, 2, 'Late', 27, 'تاخیر (۲۷ دقیقه)'),
(35, 13, 2, 'Present', 0, 'حاضر'),
(36, 14, 2, 'Present', 0, 'حاضر'),
(37, 15, 2, 'Present', 0, 'حاضر'),
(39, 17, 2, 'Excused', 0, 'موجه'),
(40, 18, 2, 'Late', 25, 'تاخیر (25 دقیقه)'),
(41, 19, 2, 'Excused', 0, 'موجه'),
(42, 20, 2, 'Late', 5, 'تاخیر (5 دقیقه)'),
(44, 22, 2, 'Present', 0, 'حاضر'),
(45, 1, 3, 'Present', 0, 'حاضر'),
(46, 2, 3, 'Late', 5, 'تاخیر (5)'),
(47, 3, 3, 'Present', 0, 'حاضر'),
(48, 4, 3, 'Present', 0, 'حاضر'),
(49, 5, 3, 'Present', 0, 'حاضر'),
(50, 6, 3, 'Present', 0, 'حاضر'),
(51, 7, 3, 'Present', 0, 'حاضر'),
(52, 8, 3, 'Present', 0, 'حاضر'),
(53, 9, 3, 'Present', 0, 'حاضر'),
(54, 10, 3, 'Present', 0, 'حاضر'),
(55, 11, 3, 'Present', 0, 'حاضر'),
(56, 12, 3, 'Late', 4, 'تاخیر (۴ دقیقه)'),
(57, 13, 3, 'Present', 0, 'حاضر'),
(58, 14, 3, 'Present', 0, 'حاضر'),
(59, 15, 3, 'Excused', 0, 'موجه'),
(61, 17, 3, 'Late', 51, 'تاخیر (51 دقیقه)'),
(62, 18, 3, 'Late', 13, 'تاخیر (13 دقیقه)'),
(63, 19, 3, 'Present', 0, 'حاضر'),
(64, 20, 3, 'Late', 36, 'تاخیر (36 دقیقه)'),
(66, 22, 3, 'Present', 0, 'حاضر'),
(67, 1, 4, 'Present', 0, 'حاضر'),
(68, 2, 4, 'Present', 0, 'حاضر'),
(69, 3, 4, 'Present', 0, 'حاضر'),
(70, 4, 4, 'Present', 0, 'حاضر'),
(71, 5, 4, 'Absent', 0, 'غیبت'),
(72, 6, 4, 'Late', 10, 'تاخیر (10)'),
(73, 7, 4, 'Late', 15, 'تاخیر (15)'),
(74, 8, 4, 'Present', 0, 'حاضر'),
(75, 9, 4, 'Present', 0, 'حاضر'),
(76, 10, 4, 'Present', 0, 'حاضر'),
(77, 11, 4, 'Absent', 0, 'غیبت'),
(78, 12, 4, 'Excused', 0, 'موجه'),
(79, 13, 4, 'Present', 0, 'حاضر'),
(80, 14, 4, 'Present', 0, 'حاضر'),
(81, 15, 4, 'Late', 5, 'تاخیر (۵ دقیقه)'),
(83, 17, 4, 'Late', 5, 'تاخیر (5 دقیقه)'),
(84, 18, 4, 'Excused', 0, 'موجه'),
(85, 19, 4, 'Excused', 0, 'موجه'),
(86, 20, 4, 'Present', 0, 'حاضر'),
(88, 22, 4, 'Present', 0, 'حاضر'),
(89, 2, 5, 'Present', 0, 'حاضر'),
(90, 3, 5, 'Present', 0, 'حاضر'),
(91, 4, 5, 'Present', 0, 'حاضر'),
(92, 5, 5, 'Present', 0, 'حاضر'),
(93, 6, 5, 'Present', 0, 'حاضر'),
(94, 7, 5, 'Present', 0, 'حاضر'),
(95, 8, 5, 'Present', 0, 'حاضر'),
(96, 9, 5, 'Present', 0, 'حاضر'),
(97, 10, 5, 'Present', 0, 'حاضر'),
(98, 11, 5, 'Late', 15, 'تاخیر (15 دقیقه)'),
(99, 12, 5, 'Present', 0, 'حاضر'),
(100, 13, 5, 'Present', 0, 'حاضر'),
(101, 14, 5, 'Present', 0, 'حاضر'),
(102, 15, 5, 'Present', 0, 'حاضر'),
(104, 17, 5, 'Present', 0, 'حاضر'),
(105, 18, 5, 'Present', 0, 'حاضر'),
(106, 19, 5, 'Present', 0, 'حاضر'),
(107, 20, 5, 'Present', 0, 'حاضر'),
(109, 22, 5, 'Late', 5, 'تاخیر (5 دقیقه)'),
(110, 2, 6, 'Present', 0, 'حاضر'),
(111, 3, 6, 'Present', 0, 'حاضر'),
(112, 4, 6, 'Present', 0, 'حاضر'),
(113, 5, 6, 'Present', 0, 'حاضر'),
(114, 6, 6, 'Present', 0, 'حاضر'),
(115, 7, 6, 'Present', 0, 'حاضر'),
(116, 8, 6, 'Present', 0, 'حاضر'),
(117, 9, 6, 'Present', 0, 'حاضر'),
(118, 10, 6, 'Present', 0, 'حاضر'),
(119, 11, 6, 'Late', 15, 'تاخیر (15 دقیقه)'),
(120, 12, 6, 'Present', 0, 'حاضر'),
(121, 13, 6, 'Present', 0, 'حاضر'),
(122, 14, 6, 'Present', 0, 'حاضر'),
(123, 15, 6, 'Present', 0, 'حاضر'),
(125, 17, 6, 'Present', 0, 'حاضر'),
(126, 18, 6, 'Present', 0, 'حاضر'),
(127, 19, 6, 'Present', 0, 'حاضر'),
(128, 20, 6, 'Late', 5, 'تاخیر (5 دقیقه)'),
(130, 22, 6, 'Late', 5, 'تاخیر (5 دقیقه)'),
(131, 3, 8, 'Present', 0, 'حاضر'),
(132, 4, 8, 'Present', 0, 'حاضر'),
(133, 5, 8, 'Present', 0, 'حاضر'),
(134, 6, 8, 'Present', 0, 'حاضر'),
(135, 7, 8, 'Present', 0, 'حاضر'),
(136, 8, 8, 'Present', 0, 'حاضر'),
(137, 9, 8, 'Late', 10, 'تاخیر (10)'),
(138, 10, 8, 'Present', 0, 'حاضر'),
(139, 11, 8, 'Absent', 0, 'غیبت'),
(140, 12, 8, 'Present', 0, 'حاضر'),
(141, 13, 8, 'Present', 0, 'حاضر'),
(142, 14, 8, 'Present', 0, 'حاضر'),
(143, 15, 8, 'Late', 10, 'تاخیر (۱۰ دقیقه)'),
(145, 17, 8, 'Late', 22, 'تاخیر (22 دقیقه)'),
(146, 18, 8, 'Present', 0, 'حاضر'),
(147, 19, 8, 'Late', 33, 'تاخیر (33 دقیقه)'),
(148, 20, 8, 'Late', 40, 'تاخیر (40 دقیقه)'),
(150, 22, 8, 'Late', 11, 'تاخیر (11 دقیقه)'),
(151, 2, 7, 'Late', 10, 'تاخیر (10)'),
(152, 3, 7, 'Present', 0, 'حاضر'),
(153, 4, 7, 'Present', 0, 'حاضر'),
(154, 5, 7, 'Present', 0, 'حاضر'),
(155, 6, 7, 'Late', 10, 'تاخیر (10)'),
(156, 7, 7, 'Present', 0, 'حاضر'),
(157, 8, 7, 'Present', 0, 'حاضر'),
(158, 9, 7, 'Present', 0, 'حاضر'),
(159, 10, 7, 'Present', 0, 'حاضر'),
(160, 11, 7, 'Present', 0, 'حاضر'),
(161, 12, 7, 'Late', 8, 'تاخیر (۸ دقیقه)'),
(162, 13, 7, 'Present', 0, 'حاضر'),
(163, 14, 7, 'Present', 0, 'حاضر'),
(164, 15, 7, 'Late', 21, 'تاخیر (۲۱ دقیقه)'),
(166, 17, 7, 'Present', 0, 'حاضر'),
(167, 18, 7, 'Present', 0, 'حاضر'),
(168, 19, 7, 'Present', 0, 'حاضر'),
(169, 20, 7, 'Late', 25, 'تاخیر (25 دقیقه)'),
(171, 22, 7, 'Present', 0, 'حاضر'),
(172, 8, 9, 'Present', 0, 'حاضر'),
(173, 9, 9, 'Late', 5, 'تاخیر (5)'),
(174, 10, 9, 'Present', 0, 'حاضر'),
(175, 11, 9, 'Present', 0, 'حاضر'),
(176, 12, 9, 'Present', 0, 'حاضر'),
(177, 13, 9, 'Present', 0, 'حاضر'),
(178, 14, 9, 'Present', 0, 'حاضر'),
(179, 15, 9, 'Late', 5, 'تاخیر (۵ دقیقه)'),
(181, 17, 9, 'Late', 5, 'تاخیر (5 دقیقه)'),
(182, 18, 9, 'Late', 25, 'تاخیر (25 دقیقه)'),
(183, 19, 9, 'Present', 0, 'حاضر'),
(184, 20, 9, 'Present', 0, 'حاضر'),
(186, 22, 9, 'Present', 0, 'حاضر'),
(188, 17, 10, 'Present', 0, 'حاضر'),
(189, 18, 10, 'Present', 0, 'حاضر'),
(190, 19, 10, 'Present', 0, 'حاضر'),
(191, 20, 10, 'Present', 0, 'حاضر'),
(193, 22, 10, 'Late', 5, 'تاخیر (5 دقیقه)'),
(194, 17, 11, 'Present', 0, 'حاضر'),
(195, 18, 11, 'Late', 14, 'تاخیر (14 دقیقه)'),
(196, 19, 11, 'Absent', 0, 'غیبت'),
(197, 20, 11, 'Absent', 0, 'غیبت'),
(199, 22, 11, 'Present', 0, 'حاضر'),
(200, 22, 12, 'Late', 9, 'تاخیر (9 دقیقه)'),
(201, 201, 7, 'Late', 4, 'تاخیر (4 دقیقه)'),
(202, 201, 5, 'Late', 5, 'تاخیر (5 دقیقه)'),
(203, 201, 3, 'Present', 0, 'حاضر'),
(204, 201, 2, 'Late', 4, 'تاخیر (4 دقیقه)'),
(205, 201, 6, 'Late', 5, 'تاخیر (5 دقیقه)'),
(206, 201, 8, 'Late', 9, 'تاخیر (9 دقیقه)'),
(207, 201, 4, 'Present', 0, 'حاضر'),
(208, 201, 1, 'Late', 4, 'تاخیر (4 دقیقه)'),
(209, 201, 9, 'Present', 0, 'حاضر'),
(210, 201, 10, 'Present', 0, 'حاضر'),
(211, 201, 11, 'Late', 11, 'تاخیر (11 دقیقه)'),
(212, 201, 12, 'Late', 4, 'تاخیر (4 دقیقه)'),
(214, 202, 7, 'Late', 2, 'تاخیر (2 دقیقه)'),
(215, 202, 5, 'Present', 0, 'حاضر'),
(216, 202, 3, 'Late', 13, 'تاخیر (13 دقیقه)'),
(217, 202, 2, 'Present', 0, 'حاضر'),
(218, 202, 6, 'Present', 0, 'حاضر'),
(219, 202, 8, 'Late', 25, 'تاخیر (25 دقیقه)'),
(220, 202, 4, 'Present', 0, 'حاضر'),
(221, 202, 1, 'Present', 0, 'حاضر'),
(222, 202, 9, 'Present', 0, 'حاضر'),
(223, 202, 10, 'Present', 0, 'حاضر'),
(224, 202, 11, 'Present', 0, 'حاضر'),
(225, 202, 12, 'Absent', 0, 'غیبت'),
(250, 205, 3, 'Late', 3, 'تاخیر (3 دقیقه)'),
(251, 205, 7, 'Present', 0, 'حاضر'),
(252, 205, 5, 'Late', 3, 'تاخیر (3 دقیقه)'),
(253, 205, 6, 'Late', 3, 'تاخیر (3 دقیقه)'),
(254, 205, 2, 'Present', 0, 'حاضر'),
(255, 205, 8, 'Present', 0, 'حاضر'),
(256, 205, 4, 'Present', 0, 'حاضر'),
(257, 205, 1, 'Present', 0, 'حاضر'),
(258, 205, 9, 'Present', 0, 'حاضر'),
(259, 205, 10, 'Present', 0, 'حاضر'),
(260, 205, 11, 'Absent', 0, 'غیبت'),
(261, 205, 12, 'Present', 0, 'حاضر'),
(262, 206, 3, 'Late', 3, 'تاخیر (3 دقیقه)'),
(263, 206, 7, 'Late', 14, 'تاخیر (14 دقیقه)'),
(264, 206, 5, 'Present', 0, 'حاضر'),
(265, 206, 6, 'Excused', 0, 'موجه'),
(266, 206, 2, 'Present', 0, 'حاضر'),
(267, 206, 8, 'Late', 1, 'تاخیر (1 دقیقه)'),
(268, 206, 4, 'Present', 0, 'حاضر'),
(269, 206, 1, 'Late', 14, 'تاخیر (14 دقیقه)'),
(270, 206, 9, 'Present', 0, 'حاضر'),
(271, 206, 10, 'Excused', 0, 'موجه'),
(272, 206, 12, 'Late', 14, 'تاخیر (14 دقیقه)'),
(273, 206, 11, 'Present', 0, 'حاضر'),
(274, 207, 3, 'Present', 0, 'حاضر'),
(275, 207, 7, 'Late', 6, 'تاخیر (6 دقیقه)'),
(276, 207, 5, 'Present', 0, 'حاضر'),
(277, 207, 6, 'Present', 0, 'حاضر'),
(278, 207, 2, 'Present', 0, 'حاضر'),
(279, 207, 8, 'Late', 5, 'تاخیر (5 دقیقه)'),
(280, 207, 4, 'Present', 0, 'حاضر'),
(281, 207, 1, 'Late', 14, 'تاخیر (14 دقیقه)'),
(282, 207, 9, 'Present', 0, 'حاضر'),
(283, 207, 10, 'Present', 0, 'حاضر'),
(284, 207, 12, 'Late', 14, 'تاخیر (14 دقیقه)'),
(285, 207, 11, 'Absent', 0, 'غیبت'),
(286, 208, 3, 'Present', 0, 'حاضر'),
(287, 208, 7, 'Present', 0, 'حاضر'),
(288, 208, 5, 'Late', 6, 'تاخیر (6 دقیقه)'),
(289, 208, 6, 'Late', 11, 'تاخیر (11 دقیقه)'),
(290, 208, 2, 'Present', 0, 'حاضر'),
(291, 208, 8, 'Present', 0, 'حاضر'),
(292, 208, 4, 'Absent', 0, 'غیبت'),
(293, 208, 1, 'Present', 0, 'حاضر'),
(294, 208, 9, 'Absent', 0, 'غیبت'),
(295, 208, 10, 'Present', 0, 'حاضر'),
(296, 208, 12, 'Present', 0, 'حاضر'),
(297, 208, 11, 'Present', 0, 'حاضر'),
(298, 209, 3, 'Present', 0, 'حاضر'),
(299, 209, 7, 'Present', 0, 'حاضر'),
(300, 209, 5, 'Present', 0, 'حاضر'),
(301, 209, 6, 'Present', 0, 'حاضر'),
(302, 209, 2, 'Present', 0, 'حاضر'),
(303, 209, 8, 'Late', 5, 'تاخیر (5 دقیقه)'),
(304, 209, 1, 'Late', 10, 'تاخیر (10 دقیقه)'),
(305, 209, 4, 'Late', 5, 'تاخیر (5 دقیقه)'),
(306, 209, 9, 'Present', 0, 'حاضر'),
(307, 209, 10, 'Late', 5, 'تاخیر (5 دقیقه)'),
(308, 209, 12, 'Present', 0, 'حاضر'),
(309, 209, 11, 'Present', 0, 'حاضر'),
(310, 209, 14, 'Present', 0, 'حاضر'),
(311, 210, 3, 'Late', 21, 'تاخیر (21 دقیقه)'),
(312, 210, 7, 'Present', 0, 'حاضر'),
(313, 210, 5, 'Late', 7, 'تاخیر (7 دقیقه)'),
(314, 210, 6, 'Late', 7, 'تاخیر (7 دقیقه)'),
(315, 210, 2, 'Present', 0, 'حاضر'),
(316, 210, 8, 'Present', 0, 'حاضر'),
(317, 210, 1, 'Late', 25, 'تاخیر (25 دقیقه)'),
(318, 210, 4, 'Present', 0, 'حاضر'),
(319, 210, 9, 'Present', 0, 'حاضر'),
(320, 210, 10, 'Present', 0, 'حاضر'),
(321, 210, 12, 'Present', 0, 'حاضر'),
(322, 210, 11, 'Present', 0, 'حاضر'),
(323, 210, 14, 'Present', 0, 'حاضر');

-- --------------------------------------------------------

--
-- Table structure for table `attendance_sessions`
--

CREATE TABLE `attendance_sessions` (
  `id` int(11) NOT NULL,
  `session_date` varchar(20) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `attendance_sessions`
--

INSERT INTO `attendance_sessions` (`id`, `session_date`, `created_at`) VALUES
(1, '1404/08/14', '2026-04-29 12:50:04'),
(2, '1404/08/21', '2026-04-29 12:50:04'),
(3, '1404/08/28', '2026-04-29 12:50:04'),
(4, '1404/09/05', '2026-04-29 12:50:04'),
(5, '1404/09/12', '2026-04-29 12:50:04'),
(6, '1404/09/19', '2026-04-29 12:50:04'),
(7, '1404/09/26', '2026-04-29 12:50:04'),
(8, '1404/10/03', '2026-04-29 12:50:04'),
(9, '1404/10/10', '2026-04-29 12:50:04'),
(10, '1404/10/17', '2026-04-29 12:50:04'),
(11, '1404/11/01', '2026-04-29 12:50:04'),
(12, '1404/11/08', '2026-04-29 12:50:04'),
(13, '1404/11/14', '2026-04-29 12:50:04'),
(14, '1404/11/17', '2026-04-29 12:50:04'),
(15, '1404/11/29', '2026-04-29 12:50:04'),
(17, '1404/12/06', '2026-04-29 12:50:04'),
(18, '1404/12/20', '2026-04-29 12:50:04'),
(19, '1404/12/27', '2026-04-29 12:50:04'),
(20, '1405/01/19', '2026-04-29 12:50:04'),
(22, '1405/01/26', '2026-04-29 12:50:04'),
(201, '1405/02/02', '2026-04-29 17:25:45'),
(202, '1405/02/09', '2026-04-29 17:37:54'),
(205, '1405/02/16', '2026-05-06 19:54:15'),
(206, '1405/02/23', '2026-05-14 15:01:19'),
(207, '1405/02/30', '2026-05-21 05:36:18'),
(208, '1405/03/06', '2026-05-28 07:02:54'),
(209, '1405/03/27', '2026-06-17 17:43:53'),
(210, '1405/04/10', '2026-07-01 20:32:04');

-- --------------------------------------------------------

--
-- Table structure for table `essentials`
--

CREATE TABLE `essentials` (
  `id` int(11) NOT NULL,
  `plan_id` varchar(40) NOT NULL,
  `item_date` varchar(20) DEFAULT NULL,
  `title` varchar(255) DEFAULT NULL,
  `priority` varchar(20) DEFAULT NULL,
  `item_name` varchar(255) DEFAULT NULL,
  `uid` varchar(50) NOT NULL,
  `done` tinyint(1) NOT NULL DEFAULT 0,
  `item_type` varchar(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `essentials`
--

INSERT INTO `essentials` (`id`, `plan_id`, `item_date`, `title`, `priority`, `item_name`, `uid`, `done`, `item_type`) VALUES
(1, '1767382153858', '1404/09/26', 'جلسه هفتم میزبان عماد', 'low', 'توپ پینگ پنگ', '89506', 0, 'have'),
(2, '1767382153858', '1404/09/26', 'جلسه هفتم میزبان عماد', 'low', 'لیوان', '60164', 0, 'have'),
(3, '1767382153858', '1404/09/26', 'جلسه هفتم میزبان عماد', 'low', 'چسب', '4330', 0, 'have'),
(4, '1767382153858', '1404/09/26', 'جلسه هفتم میزبان عماد', 'low', 'کلاه گیس', '28006', 0, 'buy'),
(5, '1767382153858', '1404/09/26', 'جلسه هفتم میزبان عماد', 'low', 'چتر', '78989', 0, 'buy'),
(6, '1767382153858', '1404/09/26', 'جلسه هفتم میزبان عماد', 'low', 'چتر', '40554', 0, 'have'),
(7, '1767382851613', '1404/10/03', 'جلسه هشتم میزبان علی مجردی', 'low', 'زوبین', '51279', 0, 'have'),
(8, '1767382851613', '1404/10/03', 'جلسه هشتم میزبان علی مجردی', 'low', 'لیوان', '934', 0, 'have'),
(9, '1767382851613', '1404/10/03', 'جلسه هشتم میزبان علی مجردی', 'low', 'توپ', '37785', 0, 'have'),
(10, '1767779719716', '1404/10/17', 'جلسه دهم منزل مهدیار خاطریان', 'low', 'لبتاب', '54430', 0, 'have'),
(11, '1767779719716', '1404/10/17', 'جلسه دهم منزل مهدیار خاطریان', 'low', 'hdmi', '5234', 0, 'have'),
(12, '1767779719716', '1404/10/17', 'جلسه دهم منزل مهدیار خاطریان', 'low', 'پتو', '49580', 0, 'buy'),
(13, '1767779719716', '1404/10/17', 'جلسه دهم منزل مهدیار خاطریان', 'low', 'لامپ شارژی', '11202', 0, 'have'),
(14, '1767779719716', '1404/10/17', 'جلسه دهم منزل مهدیار خاطریان', 'low', 'لیوان پلاستیکی و کیسه فریزر', '36401', 0, 'buy'),
(15, '1767779719716', '1404/10/17', 'جلسه دهم منزل مهدیار خاطریان', 'low', 'پرینت کاغذ ها', '98431', 0, 'have'),
(16, '1767779719716', '1404/10/17', 'جلسه دهم منزل مهدیار خاطریان', 'low', 'قیچی و چسب', '10462', 0, 'have'),
(17, '1769118889922', '1404/11/01', 'جلسه یازدهم خونه سجاد', 'low', 'مهره', '80101', 0, 'have'),
(18, '1769118889922', '1404/11/01', 'جلسه یازدهم خونه سجاد', 'low', 'سیخ کباب', '22857', 0, 'have'),
(19, '1767381788525', '1404/09/19', 'جلسه شیشم میزبان محمدصالح', 'low', 'بادکنک', '49008', 0, 'buy'),
(20, '1767381788525', '1404/09/19', 'جلسه شیشم میزبان محمدصالح', 'low', 'کلاه گیس', '81981', 0, 'have'),
(21, '1767381788525', '1404/09/19', 'جلسه شیشم میزبان محمدصالح', 'low', 'نامه اول جزیره', '93964', 0, 'buy'),
(22, '1767381788525', '1404/09/19', 'جلسه شیشم میزبان محمدصالح', 'low', 'چتر', '74178', 0, 'have'),
(23, '1767381788525', '1404/09/19', 'جلسه شیشم میزبان محمدصالح', 'low', 'عینک افتابی', '99953', 0, 'have'),
(24, '1767381788525', '1404/09/19', 'جلسه شیشم میزبان محمدصالح', 'low', 'پرینت کاغذ ها', '53848', 0, 'buy'),
(25, '1769494545218', '1404/11/08', 'جلسه دوازدهم خونه محمدمهدی', 'high', 'چسب کاغذی', '60838', 0, 'buy'),
(26, '1771448422365', '1404/11/29', 'جلسه سیزدهم', 'low', 'توپ', '75891', 0, 'have'),
(27, '1771448422365', '1404/11/29', 'جلسه سیزدهم', 'low', 'تاج', '26294', 0, 'buy'),
(28, '1771448422365', '1404/11/29', 'جلسه سیزدهم', 'low', 'چادر برای شنل', '36120', 0, 'buy'),
(31, '1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', 'لیوان', '65853', 0, 'have'),
(32, '1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', 'توپ پینگ پنگ', '70700', 0, 'have'),
(33, '1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', 'پاکت نامه', '60869', 0, 'have'),
(34, '1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', 'پاکت نامه طلایی', '3164', 0, 'have'),
(35, '1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', 'اسپیکر', '58323', 0, 'have'),
(36, '1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', 'کاغذ رنگی', '10725', 0, 'have'),
(37, '1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', 'پاکت نامه', '13991', 0, 'have'),
(38, '1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', 'خودکار', '77771', 0, 'have'),
(42, '1775699763022', '1405/01/19', 'جلسه هفتهم میزبانی علی', 'low', 'کاغذ اچار', '14538', 0, 'have'),
(43, '1776459045185', '1405/01/26', 'جلسه هجدهم منزل سجاد', 'low', 'طلق دوز', '77432', 0, 'have'),
(44, '1776459045185', '1405/01/26', 'جلسه هجدهم منزل سجاد', 'low', 'اکسسوری های نمایش', '9892', 0, 'have'),
(50, '1777484119061', '1405/02/09', 'جلسه بیستم منزل محمد', 'low', 'پرینت خانه ها', '82871', 0, 'have'),
(51, '1777484119061', '1405/02/09', 'جلسه بیستم منزل محمد', 'low', 'پاورپوینت', '9651814', 0, 'have'),
(58, '1777744913355', '1405/02/16', 'جلسه بیست و یکم منزل مهدیار شکوری', 'low', 'لیوان یک بار مصرف', '884311', 0, 'have'),
(59, '1777744913355', '1405/02/16', 'جلسه بیست و یکم منزل مهدیار شکوری', 'low', 'توپ پینگ پنگ', '8426669', 0, 'have'),
(60, '1777744913355', '1405/02/16', 'جلسه بیست و یکم منزل مهدیار شکوری', 'low', 'صندوق چه باشگاه قهرمانان کوچک', '7026762', 0, 'have'),
(61, '1777483027796', '1405/02/02', 'جلسه نوزندهم منزل ابوالفضل', 'low', 'توپ پینگ پنگ', '8042944', 0, 'have'),
(62, '1777483027796', '1405/02/02', 'جلسه نوزندهم منزل ابوالفضل', 'low', 'دروازه کوچیک', '1777235', 0, 'have'),
(63, '1777483027796', '1405/02/02', 'جلسه نوزندهم منزل ابوالفضل', 'low', 'ریش و کلاه گیس', '7722660', 0, 'have'),
(64, '1777483027796', '1405/02/02', 'جلسه نوزندهم منزل ابوالفضل', 'low', 'شال برای بستن صورت', '6407471', 0, 'have'),
(65, '1777483027796', '1405/02/02', 'جلسه نوزندهم منزل ابوالفضل', 'low', 'اسپیکر', '6638410', 0, 'have'),
(66, '1777483027796', '1405/02/02', 'جلسه نوزندهم منزل ابوالفضل', 'low', 'ویس شب و روز', '9083899', 0, 'have'),
(67, '1772048991768', '1404/12/06', 'جلسه چهاردهم', 'low', 'قاشق', '5602972', 0, 'have'),
(68, '1772048991768', '1404/12/06', 'جلسه چهاردهم', 'low', 'توپ پینگ پنگ', '6421599', 0, 'have'),
(69, '1774487307300', '1404/12/27', 'جلسه شونزدهم خونه عماد', 'low', 'منجنیق', '1619027', 0, 'have'),
(70, '1774487307300', '1404/12/27', 'جلسه شونزدهم خونه عماد', 'low', 'لیوان', '3768040', 0, 'have'),
(71, '1774487307300', '1404/12/27', 'جلسه شونزدهم خونه عماد', 'low', 'زنگوله', '8463791', 0, 'have'),
(72, '1774487307300', '1404/12/27', 'جلسه شونزدهم خونه عماد', 'low', 'ساخت پاورپوینت اتفاقات سال جدید', '5535508', 0, 'have'),
(73, '1774487307300', '1404/12/27', 'جلسه شونزدهم خونه عماد', 'low', 'ساخت عکس', '8746741', 0, 'have'),
(74, '1778770620691', '1405/02/23', 'جلسه ۲۲م منزل مهدیار خاطریان', 'low', 'پرینت کارت های ابیلیتی مسیر', '4111544', 0, 'have'),
(75, '1778770620691', '1405/02/23', 'جلسه ۲۲م منزل مهدیار خاطریان', 'low', 'استوانه های امتیاز', '2696402', 0, 'have'),
(76, '1778770620691', '1405/02/23', 'جلسه ۲۲م منزل مهدیار خاطریان', 'low', 'تیله ها در دو رنگ', '6623139', 0, 'have'),
(77, '1779341642319', '1405/02/30', 'جلسه ۲۳م خونه محمدمهدی', 'low', 'توپ', '4081904', 0, 'have'),
(78, '1779341642319', '1405/02/30', 'جلسه ۲۳م خونه محمدمهدی', 'low', 'پرینت', '2530357', 0, 'have'),
(79, '1779951721414', '1405/03/06', 'جلسه۲۴م خونه امیرعلی', 'low', 'برد نقطه زن', '40472', 0, 'have'),
(80, '1779951721414', '1405/03/06', 'جلسه۲۴م خونه امیرعلی', 'low', 'دارت', '9523459', 0, 'have'),
(81, '1781718073830', '1405/03/27', 'جلسه ۲۵م میزبان عماد بام لانژ ', 'low', 'پاورپوینت', '3724438', 0, 'have'),
(82, '1782937874841', '1405/04/10', 'جلسه ۲۶م منزل پرهام رجبی پور', 'low', 'چوب و دوک', '5357529', 0, 'have'),
(83, '1782937874841', '1405/04/10', 'جلسه ۲۶م منزل پرهام رجبی پور', 'low', 'نخ کاموا', '8835638', 0, 'have'),
(84, '1782937874841', '1405/04/10', 'جلسه ۲۶م منزل پرهام رجبی پور', 'low', 'پرینت عکس ها', '2682211', 0, 'have'),
(85, '1782937874841', '1405/04/10', 'جلسه ۲۶م منزل پرهام رجبی پور', 'low', 'شلنگ', '5999461', 0, 'have'),
(86, '1782937874841', '1405/04/10', 'جلسه ۲۶م منزل پرهام رجبی پور', 'low', 'بالشت', '1981538', 0, 'have'),
(87, '1782937874841', '1405/04/10', 'جلسه ۲۶م منزل پرهام رجبی پور', 'low', 'اکسسوری های نمایش', '7745928', 0, 'have');

-- --------------------------------------------------------

--
-- Table structure for table `mi_config`
--

CREATE TABLE `mi_config` (
  `id` int(11) NOT NULL,
  `type` varchar(190) NOT NULL,
  `scientific_desc` text DEFAULT NULL,
  `positive_traits` text DEFAULT NULL,
  `negative_traits` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `mi_config`
--

INSERT INTO `mi_config` (`id`, `type`, `scientific_desc`, `positive_traits`, `negative_traits`) VALUES
(1, 'هوش کلامی 🗣️', 'افراد با هوش کلامی بالا، مجریان و سخنوران توانمندی هستند.', 'پرگو و وراجی (تمایل زیاد به صحبت کردن),استفاده از واژگان غنی (دایره لغات وسیع و حاضرجوابی),شنوندگان فعال (دقت به صحبت‌های دیگران),تکلم زودهنگام در کودکی,تعامل کلامی با بزرگسالان در کودکی,صحبت با جزئیات (توضیحات و روایت‌های مفصل),صدای جذاب و رسا (لحن دلنشین و گیرا),تمایل به آموزش در کلاس', ''),
(2, 'هوش منطقی-ریاضی 🔢', 'افراد با هوش منطقی-ریاضی اغلب مدرسین خود را به چالش می‌کشند.', 'پرسش‌های مکرر و غیرمعمول (سوالات چالش‌برانگیز),توانایی در دسته‌بندی اطلاعات,یادگیری سریع رنگ‌ها و اسامی,صحبت فراتر از سن (گفتار پخته),توانایی در فهم ریاضیات,علاقه‌مندی به بازی‌های فکری و حل مسئله,علاقه زیاد به یادگیری,تمرکز بالا و تحرک کمتر,نگاه انتقادی به مسائل', ''),
(3, 'هوش بین فردی 🤝', 'توانایی درک و تعامل مؤثر با دیگران.', 'درک سریع احساسات اطرافیان,برقراری ارتباط سریع از کودکی,واکنش‌های هیجانی سنجیده و مناسب,موفقیت در بیان عقاید و احساسات,مسالمت‌جو و صلح‌جو در میان همسالان,سازش‌پذیری و معاشرت بالا,دوستان زیاد و توانایی رهبری گروه,درک بالای شرایط و احوال دیگران', ''),
(4, 'هوش درون فردی 🧘', 'توانایی شناخت خود و کنترل هیجانات درونی.', 'آرامش و وقار (متانت خاص),ترجیح تنهایی برای حل مسائل,شهود و حس ششم قوی,اعتماد به نفس بالا,توانایی بالا در کنترل احساسات (خشم),اصلاح رفتار پس از اشتباه,لذت از فعالیت‌های فردی (مطالعه و نوشتن),خلاقیت و تخیل بسیار قوی,طرح پرسش‌های وجودی و عمیق,رفتار و پوشش فراتر از سن', ''),
(5, 'هوش تصویری/فضایی 🎨', 'توانایی تجسم اجسام و خلق آثار بصری.', 'مهارت بالا در نقاشی,علاقه به مونتاژ و دمونتاژ اسباب‌بازی,توانایی عالی در حل پازل,استعداد در ساخت سازه‌های لگو,موفقیت در فعالیت‌های دستی (مجسمه‌سازی),عملکرد خوب در درس املا,حافظه تصویری قوی,علاقه به اسباب‌بازی‌های هندسی,توانایی در حل مکعب روبیک', ''),
(6, 'هوش جنبشی-حرکتی ⚽', 'توانایی استفاده از مهارت‌های بدنی و حرکتی.', 'تحرک زیاد نسبت به همسالان,حرکات تکراری دست و پا هنگام نشستن,ترجیح بازی‌های حرکتی به بازی‌های فکری,مستعد و توانمند در ورزش,داوطلب شدن برای کمک به دیگران,بی‌علاقگی به نشستن طولانی‌مدت,واکنش‌های سریع و ناگهانی,تشخیص بیش‌فعالی (احتمالی),به چالش کشیدن تعادل بدن', ''),
(7, 'هوش طبیعت‌گرا 🌿', 'علاقه به شناخت و حفظ محیط زیست و موجودات زنده.', 'علاقه زیاد به گیاهان و حیوانات (نگهداری در منزل),علاقه‌مند به مباحث حیات وحش و طبیعت,علاقه به حضور در طبیعت و فضاهای سرسبز,علاقه به جمع‌آوری نمونه‌های طبیعت (حشرات),حساسیت به حفظ طبیعت و نظافت محیط', ''),
(8, 'هوش موسیقیایی 🎵', 'حساسیت به ریتم، آهنگ و صداها.', 'تشخیص ریتم,زمزمه,آواز خواندن,درک تن صدا', 'بی‌توجهی به صداها');

-- --------------------------------------------------------

--
-- Table structure for table `mi_logs`
--

CREATE TABLE `mi_logs` (
  `id` int(11) NOT NULL,
  `log_date` datetime NOT NULL DEFAULT current_timestamp(),
  `student_id` int(11) NOT NULL,
  `mi_type` varchar(190) NOT NULL,
  `behavior` text NOT NULL,
  `score` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `mi_logs`
--

INSERT INTO `mi_logs` (`id`, `log_date`, `student_id`, `mi_type`, `behavior`, `score`) VALUES
(1, '2024-03-25 13:49:00', 1, 'هوش کلامی 🗣️', 'پرگو و وراجی (تمایل زیاد به صحبت کردن)', 1),
(2, '2024-03-25 13:50:00', 1, 'هوش منطقی-ریاضی 🔢', 'پرسش‌های مکرر و غیرمعمول (سوالات چالش‌برانگیز)', 1),
(3, '2024-03-25 13:50:00', 1, 'هوش منطقی-ریاضی 🔢', 'توانایی در دسته‌بندی اطلاعات', 1),
(4, '2024-03-25 13:50:00', 1, 'هوش منطقی-ریاضی 🔢', 'یادگیری سریع رنگ‌ها و اسامی', 1),
(5, '2024-03-25 13:50:00', 1, 'هوش منطقی-ریاضی 🔢', 'علاقه‌مندی به بازی‌های فکری و حل مسئله', 1),
(6, '2024-03-25 13:50:00', 1, 'هوش منطقی-ریاضی 🔢', 'علاقه زیاد به یادگیری', 1),
(7, '2024-03-25 13:50:00', 1, 'هوش بین فردی 🤝', 'برقراری ارتباط سریع از کودکی', 1),
(8, '2024-03-25 13:50:00', 1, 'هوش بین فردی 🤝', 'دوستان زیاد و توانایی رهبری گروه', 1),
(9, '2024-03-25 13:50:00', 1, 'هوش درون فردی 🧘', 'اعتماد به نفس بالا', 1),
(10, '2024-03-25 13:50:00', 1, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(11, '2024-03-25 13:50:00', 1, 'هوش تصویری/فضایی 🎨', 'علاقه به مونتاژ و دمونتاژ اسباب‌بازی', 1),
(12, '2024-03-25 13:50:00', 1, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 1),
(13, '2024-03-25 13:50:00', 1, 'هوش تصویری/فضایی 🎨', 'استعداد در ساخت سازه‌های لگو', 1),
(14, '2024-03-25 13:50:00', 1, 'هوش تصویری/فضایی 🎨', 'موفقیت در فعالیت‌های دستی (مجسمه‌سازی)', 1),
(15, '2024-03-25 13:50:00', 1, 'هوش تصویری/فضایی 🎨', 'علاقه به اسباب‌بازی‌های هندسی', 1),
(16, '2024-03-25 13:50:00', 1, 'هوش جنبشی-حرکتی ⚽', 'تحرک زیاد نسبت به همسالان', 1),
(17, '2024-03-25 13:50:00', 1, 'هوش جنبشی-حرکتی ⚽', 'ترجیح بازی‌های حرکتی به بازی‌های فکری', 1),
(18, '2024-03-25 13:50:00', 1, 'هوش جنبشی-حرکتی ⚽', 'مستعد و توانمند در ورزش', 1),
(19, '2024-03-25 13:50:00', 1, 'هوش جنبشی-حرکتی ⚽', 'داوطلب شدن برای کمک به دیگران', 1),
(20, '2024-03-25 13:50:00', 1, 'هوش جنبشی-حرکتی ⚽', 'بی‌علاقگی به نشستن طولانی‌مدت', 1),
(21, '2024-03-25 13:50:00', 1, 'هوش جنبشی-حرکتی ⚽', 'واکنش‌های سریع و ناگهانی', 1),
(22, '2024-03-25 13:50:00', 1, 'هوش طبیعت‌گرا 🌿', 'علاقه زیاد به گیاهان و حیوانات (نگهداری در منزل)', 1),
(23, '2024-03-25 13:50:00', 1, 'هوش موسیقیایی 🎵', 'تشخیص ریتم', 1),
(24, '2024-03-25 13:50:00', 1, 'هوش موسیقیایی 🎵', 'درک تن صدا', 1),
(43, '2024-03-25 13:50:00', 3, 'هوش کلامی 🗣️', 'پرگو و وراجی (تمایل زیاد به صحبت کردن)', 1),
(44, '2024-03-25 13:50:00', 3, 'هوش کلامی 🗣️', 'شنوندگان فعال (دقت به صحبت‌های دیگران)', 1),
(45, '2024-03-25 13:50:00', 3, 'هوش کلامی 🗣️', 'تعامل کلامی با بزرگسالان در کودکی', 1),
(46, '2024-03-25 13:50:00', 3, 'هوش کلامی 🗣️', 'صحبت با جزئیات (توضیحات و روایت‌های مفصل)', 1),
(47, '2024-03-25 13:50:00', 3, 'هوش منطقی-ریاضی 🔢', 'توانایی در دسته‌بندی اطلاعات', 1),
(48, '2024-03-25 13:50:00', 3, 'هوش منطقی-ریاضی 🔢', 'یادگیری سریع رنگ‌ها و اسامی', 1),
(49, '2024-03-25 13:50:00', 3, 'هوش منطقی-ریاضی 🔢', 'صحبت فراتر از سن (گفتار پخته)', 1),
(50, '2024-03-25 13:50:00', 3, 'هوش منطقی-ریاضی 🔢', 'علاقه‌مندی به بازی‌های فکری و حل مسئله', 1),
(51, '2024-03-25 13:50:00', 3, 'هوش منطقی-ریاضی 🔢', 'تمرکز بالا و تحرک کمتر', 1),
(52, '2024-03-25 13:50:00', 3, 'هوش بین فردی 🤝', 'درک سریع احساسات اطرافیان', 1),
(53, '2024-03-25 13:50:00', 3, 'هوش بین فردی 🤝', 'مسالمت‌جو و صلح‌جو در میان همسالان', 1),
(54, '2024-03-25 13:50:00', 3, 'هوش بین فردی 🤝', 'سازش‌پذیری و معاشرت بالا', 1),
(55, '2024-03-25 13:50:00', 3, 'هوش بین فردی 🤝', 'درک بالای شرایط و احوال دیگران', 1),
(56, '2024-03-25 13:50:00', 3, 'هوش درون فردی 🧘', 'آرامش و وقار (متانت خاص)', 1),
(57, '2024-03-25 13:50:00', 3, 'هوش درون فردی 🧘', 'اعتماد به نفس بالا', 1),
(58, '2024-03-25 13:50:00', 3, 'هوش درون فردی 🧘', 'توانایی بالا در کنترل احساسات (خشم)', 1),
(59, '2024-03-25 13:50:00', 3, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(60, '2024-03-25 14:04:00', 3, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 1),
(61, '2024-03-25 14:04:00', 3, 'هوش تصویری/فضایی 🎨', 'استعداد در ساخت سازه‌های لگو', 1),
(62, '2024-03-25 14:04:00', 3, 'هوش تصویری/فضایی 🎨', 'موفقیت در فعالیت‌های دستی (مجسمه‌سازی)', 1),
(63, '2024-03-25 14:04:00', 3, 'هوش جنبشی-حرکتی ⚽', 'ترجیح بازی‌های حرکتی به بازی‌های فکری', 1),
(64, '2024-03-25 14:04:00', 3, 'هوش جنبشی-حرکتی ⚽', 'داوطلب شدن برای کمک به دیگران', 1),
(65, '2024-03-25 14:04:00', 3, 'هوش موسیقیایی 🎵', 'درک تن صدا', 1),
(66, '2024-03-25 14:04:00', 2, 'هوش کلامی 🗣️', 'پرگو و وراجی (تمایل زیاد به صحبت کردن)', 1),
(67, '2024-03-25 14:04:00', 2, 'هوش منطقی-ریاضی 🔢', 'توانایی در دسته‌بندی اطلاعات', 1),
(68, '2024-03-25 14:04:00', 2, 'هوش منطقی-ریاضی 🔢', 'یادگیری سریع رنگ‌ها و اسامی', 1),
(69, '2024-03-25 14:04:00', 2, 'هوش بین فردی 🤝', 'درک سریع احساسات اطرافیان', 1),
(70, '2024-03-25 14:04:00', 2, 'هوش بین فردی 🤝', 'موفقیت در بیان عقاید و احساسات', 1),
(71, '2024-03-25 14:04:00', 2, 'هوش بین فردی 🤝', 'مسالمت‌جو و صلح‌جو در میان همسالان', 1),
(72, '2024-03-25 14:04:00', 2, 'هوش بین فردی 🤝', 'درک بالای شرایط و احوال دیگران', 1),
(73, '2024-03-25 14:04:00', 2, 'هوش درون فردی 🧘', 'شهود و حس ششم قوی', 1),
(74, '2024-03-25 14:04:00', 2, 'هوش درون فردی 🧘', 'اعتماد به نفس بالا', 1),
(75, '2024-03-25 14:04:00', 2, 'هوش درون فردی 🧘', 'توانایی بالا در کنترل احساسات (خشم)', 1),
(76, '2024-03-25 14:04:00', 2, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(77, '2024-03-25 14:04:00', 2, 'هوش درون فردی 🧘', 'خلاقیت و تخیل بسیار قوی', 1),
(78, '2024-03-25 14:04:00', 2, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 1),
(79, '2024-03-25 14:04:00', 2, 'هوش تصویری/فضایی 🎨', 'استعداد در ساخت سازه‌های لگو', 1),
(80, '2024-03-25 14:04:00', 2, 'هوش تصویری/فضایی 🎨', 'حافظه تصویری قوی', 1),
(81, '2024-03-25 14:04:00', 2, 'هوش جنبشی-حرکتی ⚽', 'تحرک زیاد نسبت به همسالان', 1),
(82, '2024-03-25 14:04:00', 2, 'هوش جنبشی-حرکتی ⚽', 'حرکات تکراری دست و پا هنگام نشستن', 1),
(83, '2024-03-25 14:04:00', 2, 'هوش جنبشی-حرکتی ⚽', 'ترجیح بازی‌های حرکتی به بازی‌های فکری', 1),
(84, '2024-03-25 14:04:00', 2, 'هوش جنبشی-حرکتی ⚽', 'مستعد و توانمند در ورزش', 1),
(85, '2024-03-25 14:04:00', 2, 'هوش جنبشی-حرکتی ⚽', 'بی‌علاقگی به نشستن طولانی‌مدت', 1),
(86, '2024-03-25 14:04:00', 2, 'هوش جنبشی-حرکتی ⚽', 'واکنش‌های سریع و ناگهانی', 1),
(87, '2026-03-25 14:25:00', 5, 'هوش کلامی 🗣️', 'پرگو و وراجی (تمایل زیاد به صحبت کردن)', 1),
(88, '2026-03-25 14:26:00', 5, 'هوش کلامی 🗣️', 'شنوندگان فعال (دقت به صحبت‌های دیگران)', 1),
(89, '2026-03-25 14:27:00', 5, 'هوش کلامی 🗣️', 'تمایل به آموزش در کلاس', 1),
(90, '2026-03-25 14:28:00', 5, 'هوش منطقی-ریاضی 🔢', 'توانایی در دسته‌بندی اطلاعات', 1),
(91, '2026-03-25 14:29:00', 5, 'هوش منطقی-ریاضی 🔢', 'یادگیری سریع رنگ‌ها و اسامی', 1),
(92, '2026-03-25 14:29:00', 5, 'هوش منطقی-ریاضی 🔢', 'علاقه‌مندی به بازی‌های فکری و حل مسئله', 1),
(93, '2026-03-25 14:30:00', 5, 'هوش منطقی-ریاضی 🔢', 'علاقه زیاد به یادگیری', 1),
(94, '2026-03-25 14:31:00', 5, 'هوش بین فردی 🤝', 'موفقیت در بیان عقاید و احساسات', 1),
(95, '2026-03-25 14:32:00', 5, 'هوش بین فردی 🤝', 'واکنش‌های هیجانی سنجیده و مناسب', 1),
(96, '2026-03-25 14:33:00', 5, 'هوش بین فردی 🤝', 'برقراری ارتباط سریع از کودکی', 1),
(97, '2026-03-25 14:33:00', 5, 'هوش بین فردی 🤝', 'سازش‌پذیری و معاشرت بالا', 1),
(98, '2026-03-25 14:34:00', 5, 'هوش بین فردی 🤝', 'دوستان زیاد و توانایی رهبری گروه', 1),
(99, '2026-03-25 14:35:00', 5, 'هوش درون فردی 🧘', 'اعتماد به نفس بالا', 1),
(100, '2026-03-25 14:35:00', 5, 'هوش درون فردی 🧘', 'لذت از فعالیت‌های فردی (مطالعه و نوشتن)', 1),
(101, '2026-03-25 14:36:00', 5, 'هوش درون فردی 🧘', 'خلاقیت و تخیل بسیار قوی', 1),
(102, '2026-03-25 14:36:00', 5, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 1),
(103, '2026-03-25 14:37:00', 5, 'هوش تصویری/فضایی 🎨', 'استعداد در ساخت سازه‌های لگو', 1),
(104, '2026-03-25 14:38:00', 5, 'هوش تصویری/فضایی 🎨', 'حافظه تصویری قوی', 1),
(105, '2026-03-25 14:39:00', 5, 'هوش جنبشی-حرکتی ⚽', 'تحرک زیاد نسبت به همسالان', 1),
(106, '2026-03-25 14:40:00', 5, 'هوش جنبشی-حرکتی ⚽', 'ترجیح بازی‌های حرکتی به بازی‌های فکری', 1),
(107, '2026-03-25 14:40:00', 5, 'هوش جنبشی-حرکتی ⚽', 'مستعد و توانمند در ورزش', 1),
(108, '2026-03-25 14:41:00', 5, 'هوش جنبشی-حرکتی ⚽', 'واکنش‌های سریع و ناگهانی', 1),
(109, '2026-03-25 14:42:00', 5, 'هوش جنبشی-حرکتی ⚽', 'به چالش کشیدن تعادل بدن', 1),
(110, '2026-03-25 14:43:00', 6, 'هوش کلامی 🗣️', 'شنوندگان فعال (دقت به صحبت‌های دیگران)', 1),
(111, '2026-03-25 14:43:00', 6, 'هوش کلامی 🗣️', 'صحبت با جزئیات (توضیحات و روایت‌های مفصل)', 1),
(112, '2026-03-25 14:44:00', 6, 'هوش کلامی 🗣️', 'تمایل به آموزش در کلاس', 1),
(113, '2026-03-25 14:45:00', 6, 'هوش کلامی 🗣️', 'صدای جذاب و رسا (لحن دلنشین و گیرا)', 1),
(114, '2026-03-25 14:46:00', 6, 'هوش منطقی-ریاضی 🔢', 'توانایی در دسته‌بندی اطلاعات', 1),
(115, '2026-03-25 14:47:00', 6, 'هوش منطقی-ریاضی 🔢', 'یادگیری سریع رنگ‌ها و اسامی', 1),
(116, '2026-03-25 14:47:00', 6, 'هوش منطقی-ریاضی 🔢', 'نگاه انتقادی به مسائل', 1),
(117, '2026-03-25 14:48:00', 6, 'هوش منطقی-ریاضی 🔢', 'توانایی در فهم ریاضیات', 1),
(118, '2026-03-25 14:49:00', 6, 'هوش منطقی-ریاضی 🔢', 'علاقه‌مندی به بازی‌های فکری و حل مسئله', 1),
(119, '2026-03-25 14:50:00', 6, 'هوش منطقی-ریاضی 🔢', 'تمرکز بالا و تحرک کمتر', 1),
(120, '2026-03-25 14:51:00', 6, 'هوش بین فردی 🤝', 'درک سریع احساسات اطرافیان', 1),
(121, '2026-03-25 14:51:00', 6, 'هوش بین فردی 🤝', 'واکنش‌های هیجانی سنجیده و مناسب', 1),
(122, '2026-03-25 14:52:00', 6, 'هوش بین فردی 🤝', 'مسالمت‌جو و صلح‌جو در میان همسالان', 1),
(123, '2026-03-25 14:53:00', 6, 'هوش بین فردی 🤝', 'سازش‌پذیری و معاشرت بالا', 1),
(124, '2026-03-25 14:54:00', 6, 'هوش بین فردی 🤝', 'درک بالای شرایط و احوال دیگران', 1),
(125, '2026-03-25 14:54:00', 6, 'هوش درون فردی 🧘', 'آرامش و وقار (متانت خاص)', 1),
(126, '2026-03-25 14:55:00', 6, 'هوش درون فردی 🧘', 'توانایی بالا در کنترل احساسات (خشم)', 1),
(127, '2026-03-25 14:56:00', 6, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(128, '2026-03-25 14:57:00', 6, 'هوش درون فردی 🧘', 'لذت از فعالیت‌های فردی (مطالعه و نوشتن)', 1),
(129, '2026-03-25 14:58:00', 6, 'هوش درون فردی 🧘', 'خلاقیت و تخیل بسیار قوی', 1),
(130, '2026-03-25 14:58:00', 6, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 1),
(131, '2026-03-25 14:59:00', 6, 'هوش تصویری/فضایی 🎨', 'استعداد در ساخت سازه‌های لگو', 1),
(132, '2026-03-25 15:00:00', 6, 'هوش تصویری/فضایی 🎨', 'موفقیت در فعالیت‌های دستی (مجسمه‌سازی)', 1),
(133, '2026-03-25 15:01:00', 6, 'هوش تصویری/فضایی 🎨', 'علاقه به اسباب‌بازی‌های هندسی', 1),
(134, '2026-03-25 15:01:00', 6, 'هوش تصویری/فضایی 🎨', 'توانایی در حل مکعب روبیک', 1),
(135, '2026-03-25 15:02:00', 6, 'هوش جنبشی-حرکتی ⚽', 'مستعد و توانمند در ورزش', 1),
(136, '2026-03-25 15:03:00', 6, 'هوش موسیقیایی 🎵', 'درک تن صدا', 1),
(137, '2026-03-25 15:04:00', 7, 'هوش کلامی 🗣️', 'شنوندگان فعال (دقت به صحبت‌های دیگران)', 1),
(138, '2026-03-25 15:05:00', 7, 'هوش کلامی 🗣️', 'صحبت با جزئیات (توضیحات و روایت‌های مفصل)', 1),
(139, '2026-03-25 15:05:00', 7, 'هوش کلامی 🗣️', 'تمایل به آموزش در کلاس', 1),
(140, '2026-03-25 15:06:00', 7, 'هوش منطقی-ریاضی 🔢', 'پرسش‌های مکرر و غیرمعمول (سوالات چالش‌برانگیز)', 1),
(141, '2026-03-25 15:07:00', 7, 'هوش منطقی-ریاضی 🔢', 'توانایی در دسته‌بندی اطلاعات', 1),
(142, '2026-03-25 15:08:00', 7, 'هوش منطقی-ریاضی 🔢', 'یادگیری سریع رنگ‌ها و اسامی', 1),
(143, '2026-03-25 15:09:00', 7, 'هوش منطقی-ریاضی 🔢', 'علاقه‌مندی به بازی‌های فکری و حل مسئله', 1),
(144, '2026-03-25 15:09:00', 7, 'هوش منطقی-ریاضی 🔢', 'نگاه انتقادی به مسائل', 1),
(145, '2026-03-25 15:10:00', 7, 'هوش بین فردی 🤝', 'موفقیت در بیان عقاید و احساسات', 1),
(146, '2026-03-25 15:11:00', 7, 'هوش درون فردی 🧘', 'آرامش و وقار (متانت خاص)', 1),
(147, '2026-03-25 15:12:00', 7, 'هوش درون فردی 🧘', 'ترجیح تنهایی برای حل مسائل', 1),
(148, '2026-03-25 15:12:00', 7, 'هوش درون فردی 🧘', 'اعتماد به نفس بالا', 1),
(149, '2026-03-25 15:13:00', 7, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(150, '2026-03-25 15:14:00', 7, 'هوش درون فردی 🧘', 'خلاقیت و تخیل بسیار قوی', 1),
(151, '2026-03-25 15:15:00', 7, 'هوش درون فردی 🧘', 'رفتار و پوشش فراتر از سن', 1),
(152, '2026-03-25 15:16:00', 7, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 1),
(153, '2026-03-25 15:16:00', 7, 'هوش جنبشی-حرکتی ⚽', 'ترجیح بازی‌های حرکتی به بازی‌های فکری', 1),
(154, '2026-03-25 15:17:00', 7, 'هوش جنبشی-حرکتی ⚽', 'مستعد و توانمند در ورزش', 1),
(155, '2026-03-25 15:18:00', 7, 'هوش جنبشی-حرکتی ⚽', 'داوطلب شدن برای کمک به دیگران', 1),
(156, '2026-03-25 15:19:00', 8, 'هوش کلامی 🗣️', 'شنوندگان فعال (دقت به صحبت‌های دیگران)', 1),
(157, '2026-03-25 15:19:00', 8, 'هوش کلامی 🗣️', 'تعامل کلامی با بزرگسالان در کودکی', 1),
(158, '2026-03-25 15:20:00', 8, 'هوش کلامی 🗣️', 'صحبت با جزئیات (توضیحات و روایت‌های مفصل)', 1),
(159, '2026-03-25 15:21:00', 8, 'هوش منطقی-ریاضی 🔢', 'یادگیری سریع رنگ‌ها و اسامی', 1),
(160, '2026-03-25 15:22:00', 8, 'هوش منطقی-ریاضی 🔢', 'تمرکز بالا و تحرک کمتر', 1),
(161, '2026-03-25 15:23:00', 8, 'هوش بین فردی 🤝', 'موفقیت در بیان عقاید و احساسات', 1),
(162, '2026-03-25 15:23:00', 8, 'هوش بین فردی 🤝', 'مسالمت‌جو و صلح‌جو در میان همسالان', 1),
(163, '2026-03-25 15:24:00', 8, 'هوش بین فردی 🤝', 'سازش‌پذیری و معاشرت بالا', 1),
(164, '2026-03-25 15:25:00', 8, 'هوش بین فردی 🤝', 'درک بالای شرایط و احوال دیگران', 1),
(165, '2026-03-25 15:26:00', 8, 'هوش درون فردی 🧘', 'آرامش و وقار (متانت خاص)', 1),
(166, '2026-03-25 15:27:00', 8, 'هوش درون فردی 🧘', 'توانایی بالا در کنترل احساسات (خشم)', 1),
(167, '2026-03-25 15:27:00', 8, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(168, '2026-03-25 15:28:00', 8, 'هوش درون فردی 🧘', 'خلاقیت و تخیل بسیار قوی', 1),
(169, '2026-03-25 15:29:00', 8, 'هوش تصویری/فضایی 🎨', 'علاقه به مونتاژ و دمونتاژ اسباب‌بازی', 1),
(170, '2026-03-25 15:30:00', 8, 'هوش تصویری/فضایی 🎨', 'استعداد در ساخت سازه‌های لگو', 1),
(171, '2026-03-25 15:30:00', 8, 'هوش تصویری/فضایی 🎨', 'حافظه تصویری قوی', 1),
(172, '2026-03-25 15:31:00', 8, 'هوش جنبشی-حرکتی ⚽', 'ترجیح بازی‌های حرکتی به بازی‌های فکری', 1),
(173, '2026-03-25 15:32:00', 8, 'هوش جنبشی-حرکتی ⚽', 'مستعد و توانمند در ورزش', 1),
(174, '2026-03-25 15:33:00', 8, 'هوش جنبشی-حرکتی ⚽', 'داوطلب شدن برای کمک به دیگران', 1),
(175, '2026-03-25 15:34:00', 8, 'هوش جنبشی-حرکتی ⚽', 'واکنش‌های سریع و ناگهانی', 1),
(176, '2026-03-25 15:34:00', 9, 'هوش کلامی 🗣️', 'شنوندگان فعال (دقت به صحبت‌های دیگران)', 1),
(177, '2026-03-25 15:35:00', 9, 'هوش کلامی 🗣️', 'تعامل کلامی با بزرگسالان در کودکی', 1),
(178, '2026-03-25 15:36:00', 9, 'هوش کلامی 🗣️', 'صحبت با جزئیات (توضیحات و روایت‌های مفصل)', 1),
(179, '2026-03-25 15:37:00', 9, 'هوش منطقی-ریاضی 🔢', 'توانایی در دسته‌بندی اطلاعات', 1),
(180, '2026-03-25 15:38:00', 9, 'هوش منطقی-ریاضی 🔢', 'صحبت فراتر از سن (گفتار پخته)', 1),
(181, '2026-03-25 15:38:00', 9, 'هوش منطقی-ریاضی 🔢', 'توانایی در فهم ریاضیات', 1),
(182, '2026-03-25 15:39:00', 9, 'هوش منطقی-ریاضی 🔢', 'علاقه‌مندی به بازی‌های فکری و حل مسئله', 1),
(183, '2026-03-25 15:40:00', 9, 'هوش منطقی-ریاضی 🔢', 'تمرکز بالا و تحرک کمتر', 1),
(184, '2026-03-25 15:41:00', 9, 'هوش بین فردی 🤝', 'درک سریع احساسات اطرافیان', 1),
(185, '2026-03-25 15:41:00', 9, 'هوش بین فردی 🤝', 'واکنش‌های هیجانی سنجیده و مناسب', 1),
(186, '2026-03-25 15:42:00', 9, 'هوش بین فردی 🤝', 'مسالمت‌جو و صلح‌جو در میان همسالان', 1),
(187, '2026-03-25 15:43:00', 9, 'هوش بین فردی 🤝', 'سازش‌پذیری و معاشرت بالا', 1),
(188, '2026-03-25 15:44:00', 9, 'هوش بین فردی 🤝', 'درک بالای شرایط و احوال دیگران', 1),
(189, '2026-03-25 15:45:00', 9, 'هوش درون فردی 🧘', 'اعتماد به نفس بالا', 1),
(190, '2026-03-25 15:45:00', 9, 'هوش درون فردی 🧘', 'توانایی بالا در کنترل احساسات (خشم)', 1),
(191, '2026-03-25 15:46:00', 9, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(192, '2026-03-25 15:47:00', 9, 'هوش درون فردی 🧘', 'خلاقیت و تخیل بسیار قوی', 1),
(193, '2026-03-25 15:48:00', 9, 'هوش درون فردی 🧘', 'طرح پرسش‌های وجودی و عمیق', 1),
(194, '2026-03-25 15:48:00', 9, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 1),
(195, '2026-03-25 15:49:00', 9, 'هوش تصویری/فضایی 🎨', 'موفقیت در فعالیت‌های دستی (مجسمه‌سازی)', 1),
(196, '2026-03-25 15:50:00', 9, 'هوش تصویری/فضایی 🎨', 'حافظه تصویری قوی', 1),
(197, '2026-03-25 15:51:00', 10, 'هوش کلامی 🗣️', 'استفاده از واژگان غنی (دایره لغات وسیع و حاضرجوابی)', 1),
(198, '2026-03-25 15:52:00', 10, 'هوش کلامی 🗣️', 'شنوندگان فعال (دقت به صحبت‌های دیگران)', 1),
(199, '2026-03-25 15:52:00', 10, 'هوش کلامی 🗣️', 'صدای جذاب و رسا (لحن دلنشین و گیرا)', 1),
(200, '2026-03-25 15:53:00', 10, 'هوش منطقی-ریاضی 🔢', 'توانایی در دسته‌بندی اطلاعات', 1),
(201, '2026-03-25 15:54:00', 10, 'هوش منطقی-ریاضی 🔢', 'تمرکز بالا و تحرک کمتر', 1),
(202, '2026-03-25 15:55:00', 10, 'هوش بین فردی 🤝', 'درک سریع احساسات اطرافیان', 1),
(203, '2026-03-25 15:56:00', 10, 'هوش بین فردی 🤝', 'واکنش‌های هیجانی سنجیده و مناسب', 1),
(204, '2026-03-25 15:56:00', 10, 'هوش بین فردی 🤝', 'مسالمت‌جو و صلح‌جو در میان همسالان', 1),
(205, '2026-03-25 15:57:00', 10, 'هوش بین فردی 🤝', 'سازش‌پذیری و معاشرت بالا', 1),
(206, '2026-03-25 15:58:00', 10, 'هوش بین فردی 🤝', 'درک بالای شرایط و احوال دیگران', 1),
(207, '2026-03-25 15:59:00', 10, 'هوش درون فردی 🧘', 'آرامش و وقار (متانت خاص)', 1),
(208, '2026-03-25 15:59:00', 10, 'هوش درون فردی 🧘', 'اعتماد به نفس بالا', 1),
(209, '2026-03-25 16:00:00', 10, 'هوش درون فردی 🧘', 'توانایی بالا در کنترل احساسات (خشم)', 1),
(210, '2026-03-25 16:01:00', 10, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(211, '2026-03-25 16:02:00', 10, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 1),
(212, '2026-03-25 16:03:00', 10, 'هوش جنبشی-حرکتی ⚽', 'ترجیح بازی‌های حرکتی به بازی‌های فکری', 1),
(213, '2026-03-25 16:03:00', 10, 'هوش جنبشی-حرکتی ⚽', 'مستعد و توانمند در ورزش', 1),
(214, '2026-03-25 16:04:00', 10, 'هوش جنبشی-حرکتی ⚽', 'داوطلب شدن برای کمک به دیگران', 1),
(215, '2026-04-30 15:57:40', 2, 'هوش موسیقیایی 🎵', 'زمزمه', 1),
(216, '2026-05-09 14:33:30', 3, 'هوش کلامی 🗣️', 'استفاده از واژگان غنی (دایره لغات وسیع و حاضرجوابی)', 1),
(217, '2026-05-16 22:23:30', 3, 'هوش کلامی 🗣️', 'صدای جذاب و رسا (لحن دلنشین و گیرا)', 1),
(218, '2026-05-16 22:24:21', 3, 'هوش منطقی-ریاضی 🔢', 'پرسش‌های مکرر و غیرمعمول (سوالات چالش‌برانگیز)', 1),
(219, '2026-05-16 22:26:53', 3, 'هوش منطقی-ریاضی 🔢', 'علاقه زیاد به یادگیری', 1),
(220, '2026-05-16 22:27:24', 3, 'هوش بین فردی 🤝', 'واکنش‌های هیجانی سنجیده و مناسب', 1),
(221, '2026-05-16 22:30:21', 3, 'هوش درون فردی 🧘', 'خلاقیت و تخیل بسیار قوی', 1),
(222, '2026-05-16 22:30:32', 3, 'هوش درون فردی 🧘', 'طرح پرسش‌های وجودی و عمیق', 1),
(223, '2026-05-16 22:30:39', 3, 'هوش درون فردی 🧘', 'طرح پرسش‌های وجودی و عمیق', 0),
(224, '2026-05-16 22:33:01', 3, 'هوش تصویری/فضایی 🎨', 'حافظه تصویری قوی', 1),
(225, '2026-05-16 22:33:24', 3, 'هوش تصویری/فضایی 🎨', 'علاقه به اسباب‌بازی‌های هندسی', 1),
(226, '2026-05-16 22:47:06', 3, 'هوش جنبشی-حرکتی ⚽', 'ترجیح بازی‌های حرکتی به بازی‌های فکری', 0),
(227, '2026-05-16 22:47:10', 3, 'هوش جنبشی-حرکتی ⚽', 'مستعد و توانمند در ورزش', -1),
(228, '2026-05-16 22:47:31', 3, 'هوش جنبشی-حرکتی ⚽', 'تشخیص بیش‌فعالی (احتمالی)', -1),
(229, '2026-05-16 22:48:08', 3, 'هوش موسیقیایی 🎵', 'بی‌توجهی به صداها', -1),
(230, '2026-05-16 22:49:10', 7, 'هوش کلامی 🗣️', 'استفاده از واژگان غنی (دایره لغات وسیع و حاضرجوابی)', -1),
(231, '2026-05-16 22:49:33', 7, 'هوش کلامی 🗣️', 'شنوندگان فعال (دقت به صحبت‌های دیگران)', -1),
(232, '2026-05-16 22:49:54', 7, 'هوش کلامی 🗣️', 'صحبت با جزئیات (توضیحات و روایت‌های مفصل)', 0),
(233, '2026-05-16 22:50:42', 7, 'هوش منطقی-ریاضی 🔢', 'پرسش‌های مکرر و غیرمعمول (سوالات چالش‌برانگیز)', 0),
(234, '2026-05-16 22:51:26', 7, 'هوش منطقی-ریاضی 🔢', 'صحبت فراتر از سن (گفتار پخته)', -1),
(235, '2026-05-16 23:31:39', 7, 'هوش منطقی-ریاضی 🔢', 'علاقه‌مندی به بازی‌های فکری و حل مسئله', 0),
(236, '2026-05-16 23:32:47', 7, 'هوش بین فردی 🤝', 'درک سریع احساسات اطرافیان', 1),
(237, '2026-05-16 23:35:54', 7, 'هوش بین فردی 🤝', 'موفقیت در بیان عقاید و احساسات', -1),
(238, '2026-05-16 23:36:37', 7, 'هوش بین فردی 🤝', 'مسالمت‌جو و صلح‌جو در میان همسالان', -1),
(239, '2026-05-16 23:39:03', 7, 'هوش بین فردی 🤝', 'سازش‌پذیری و معاشرت بالا', 1),
(240, '2026-05-16 23:39:32', 7, 'هوش بین فردی 🤝', 'دوستان زیاد و توانایی رهبری گروه', 1),
(241, '2026-05-16 23:42:47', 7, 'هوش درون فردی 🧘', 'ترجیح تنهایی برای حل مسائل', 0),
(242, '2026-05-16 23:42:57', 7, 'هوش درون فردی 🧘', 'ترجیح تنهایی برای حل مسائل', -1),
(243, '2026-05-16 23:43:36', 7, 'هوش درون فردی 🧘', 'توانایی بالا در کنترل احساسات (خشم)', -1),
(244, '2026-05-16 23:44:06', 7, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 0),
(245, '2026-05-16 23:44:31', 7, 'هوش درون فردی 🧘', 'خلاقیت و تخیل بسیار قوی', 0),
(246, '2026-05-16 23:46:26', 7, 'هوش تصویری/فضایی 🎨', 'توانایی عالی در حل پازل', 0),
(247, '2026-05-16 23:51:27', 7, 'هوش جنبشی-حرکتی ⚽', 'تشخیص بیش‌فعالی (احتمالی)', -1),
(248, '2026-05-16 23:51:40', 7, 'هوش موسیقیایی 🎵', 'زمزمه', -1),
(249, '2026-05-16 23:51:57', 7, 'هوش موسیقیایی 🎵', 'زمزمه', 0),
(250, '2026-05-16 23:52:26', 5, 'هوش کلامی 🗣️', 'پرگو و وراجی (تمایل زیاد به صحبت کردن)', 0),
(251, '2026-05-16 23:54:57', 5, 'هوش منطقی-ریاضی 🔢', 'تمرکز بالا و تحرک کمتر', -1),
(252, '2026-05-16 23:55:45', 5, 'هوش منطقی-ریاضی 🔢', 'نگاه انتقادی به مسائل', 1),
(253, '2026-05-16 23:56:41', 5, 'هوش بین فردی 🤝', 'برقراری ارتباط سریع از کودکی', 0),
(254, '2026-05-16 23:57:07', 5, 'هوش بین فردی 🤝', 'واکنش‌های هیجانی سنجیده و مناسب', 0),
(255, '2026-05-16 23:57:13', 5, 'هوش بین فردی 🤝', 'واکنش‌های هیجانی سنجیده و مناسب', -1),
(256, '2026-05-16 23:57:46', 5, 'هوش بین فردی 🤝', 'مسالمت‌جو و صلح‌جو در میان همسالان', -1),
(257, '2026-05-16 23:58:27', 5, 'هوش بین فردی 🤝', 'سازش‌پذیری و معاشرت بالا', 0),
(258, '2026-05-16 23:58:52', 5, 'هوش بین فردی 🤝', 'درک بالای شرایط و احوال دیگران', -1),
(259, '2026-05-16 23:58:56', 5, 'هوش بین فردی 🤝', 'درک بالای شرایط و احوال دیگران', 0),
(260, '2026-05-17 00:00:35', 5, 'هوش درون فردی 🧘', 'اصلاح رفتار پس از اشتباه', 1),
(261, '2026-05-17 00:01:01', 5, 'هوش درون فردی 🧘', 'طرح پرسش‌های وجودی و عمیق', 1),
(262, '2026-05-17 00:01:14', 5, 'هوش درون فردی 🧘', 'رفتار و پوشش فراتر از سن', -1),
(263, '2026-05-17 00:01:33', 5, 'هوش تصویری/فضایی 🎨', 'استعداد در ساخت سازه‌های لگو', 0),
(264, '2026-05-17 00:01:41', 5, 'هوش تصویری/فضایی 🎨', 'استعداد در ساخت سازه‌های لگو', 1),
(265, '2026-05-17 00:01:46', 5, 'هوش تصویری/فضایی 🎨', 'موفقیت در فعالیت‌های دستی (مجسمه‌سازی)', 1),
(266, '2026-05-17 00:02:00', 5, 'هوش تصویری/فضایی 🎨', 'حافظه تصویری قوی', 0),
(267, '2026-05-17 00:03:35', 5, 'هوش جنبشی-حرکتی ⚽', 'تحرک زیاد نسبت به همسالان', 0),
(268, '2026-05-17 00:04:18', 5, 'هوش جنبشی-حرکتی ⚽', 'حرکات تکراری دست و پا هنگام نشستن', -1),
(269, '2026-05-17 00:04:22', 5, 'هوش جنبشی-حرکتی ⚽', 'حرکات تکراری دست و پا هنگام نشستن', 0),
(270, '2026-05-17 00:05:16', 5, 'هوش جنبشی-حرکتی ⚽', 'تشخیص بیش‌فعالی (احتمالی)', -1),
(271, '2026-05-17 00:05:34', 5, 'هوش جنبشی-حرکتی ⚽', 'به چالش کشیدن تعادل بدن', 0);

-- --------------------------------------------------------

--
-- Table structure for table `notes`
--

CREATE TABLE `notes` (
  `id` int(11) NOT NULL,
  `note_date` varchar(20) NOT NULL,
  `note_text` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `notes`
--

INSERT INTO `notes` (`id`, `note_date`, `note_text`, `created_at`) VALUES
(1, '1404/11/01', 'علی موقع بازی دوتا برج ساخت\n\nعلی با دستش سینه پیرزم رو نشون داد امیر علی گفت ععع بی‌تربیت\n\nعلی رک حرفشو میزنه( بهم برخورد از دختر گفتین تو داستان۰)\n\n\nاشاره نشدن به پیرزن تو داستان ها\n\n---------------------------\n\nعلی ریسک پذیر نیست\nبعد باختش عذرخواهی کرد\n\n---------------------------\n\n\nسجاد میترسه ک تیم بخاطر اون بیاره\n\nعلی زود از بازی ناامید میشه\n\n---------------------------\n\n\nبازی علی خوبه بخاطر ژنتیکش بازی تو خونه با بابا و داداشاش\n\nمحمد مهدی خیلی قانونمنده\nموقع بازی عماد خطا کرد ولی مهمد محنی بهش گفت که نکن و درست بده', '2026-04-29 12:50:05'),
(2, '1404/11/29', 'نکات و نقد هایی که بچه ها از جشن کردن\n\n\nپرهام نظری نداشت\nورود افراد غیره به اشپزخونه \n\nعلی خونه کوچیک بود \nلوکیشنش بد و خطرناک بود \nدور سیستم صوت پر بود و دخالت می‌کردن تو کار علی \nهماهنگی مجری با مسئول سیستم صوت برای پخش سرود \nو هماهنگی بازی\nنبود سراه برق و روشن نشدن ریسه هایی ک علی زده بود\nمجری همون اول جایزه هارو نداد \nمجری باید عوض بشه چون جایزه به همه داده بود😂😂🤦‍♂\n\nمحمدصالح\nپذیرایی دم در باید زودتر اماده میشد \nپیتزا زود دادیم و سرد شده بود\n\nمهدیار ش\nچسب نواری سفت نبود برای همین میریختن بادکنکا\n\nمحمدمهدی \nچسب بادکنک کم بود \nبادکنک ها که میوفتاد بچه ها فکر میکردن جایزه بدیه و انتخاب نمیکردن \nبچه ها جایزه زیاد گرفتن هرکی یکی میگرفت\n\nسجاد\nماشین هایی که تو پارکینگ بودن جا رو کوچیک کرده بودن بیرون بودن بهتر میشد\nبادکنکا کاشکی یک سمت بود \nهرکی که بازی میکرد جایزه میگرفت \n\n\nمهدیار خ \nدیر بهشون گفتیم که کیک ها و اب میوه ها برن بیرون باید زودتر بهشون میگفتیم\n\nامیرعلی \nبعضی بچه ها همش حواسشون به مهمونای خودشون بودن و به جشن فکر نمی‌کردن\nدیوار سنگی بود برای تزئینات\nنمایش نداشتیم', '2026-04-29 12:50:05'),
(3, '۱۴۰۵/۰۳/۰۶', 'نکته نماز \nاداب نماز عطر زدن قبل از نماز که مستحب هست', '2026-05-28 07:07:23');

-- --------------------------------------------------------

--
-- Table structure for table `plans`
--

CREATE TABLE `plans` (
  `id` varchar(40) NOT NULL,
  `plan_date` varchar(20) NOT NULL,
  `title` varchar(255) NOT NULL,
  `priority` varchar(20) NOT NULL DEFAULT 'low',
  `modules` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`modules`)),
  `sin` text DEFAULT NULL,
  `status` varchar(50) NOT NULL DEFAULT 'Active',
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `plans`
--

INSERT INTO `plans` (`id`, `plan_date`, `title`, `priority`, `modules`, `sin`, `status`, `updated_at`) VALUES
('1767381788525', '1404/09/19', 'جلسه شیشم میزبان محمدصالح', 'low', '[{\"type\":\"game\",\"name\":\"بادکمبت\",\"desc\":\"\",\"items\":[{\"name\":\"بادکنک\",\"type\":\"buy\"}]},{\"type\":\"story\",\"name\":\"داستان همنشین حضرت موسی \",\"desc\":\"\",\"items\":[{\"name\":\"کلاه گیس\",\"type\":\"have\"},{\"name\":\"نامه اول جزیره\",\"type\":\"buy\"},{\"name\":\"چتر\",\"type\":\"have\"},{\"name\":\"عینک افتابی\",\"type\":\"have\"}]},{\"type\":\"other\",\"name\":\"هدیه روز مادر طرح فلش \",\"desc\":\"فلش های که به فلش بعدی اشاره دارن تا مادر با دنبال کردنشون برسه به دل نوشته بچه ها\",\"items\":[{\"name\":\"پرینت کاغذ ها\",\"type\":\"buy\"}]}]', '۱۸:۳۰ تا ۱۸:۴۵ آنچه گذشت\n\n ۱۸:۴۵ تا ۱۹:۲۰ بازی \nبادکمبت\n\n۱۹:۲۵ تا ۱۹:۴۵ پذیرایی و داستان\nهمنشین حضرت موسی\n\n ۱۹:۴۵ تا ۲۰:۳۰ ساخت کاردستی و هدیه روز مادر', 'Active', '2026-04-29 12:50:05'),
('1767382153858', '1404/09/26', 'جلسه هفتم میزبان عماد', 'low', '[{\"type\":\"game\",\"name\":\"قل بال \",\"desc\":\"\",\"items\":[{\"name\":\"توپ پینگ پنگ\",\"type\":\"have\"},{\"name\":\"لیوان\",\"type\":\"have\"},{\"name\":\"چسب\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"جهانگرد و جزیره پازونگا\",\"desc\":\"\",\"items\":[{\"name\":\"کلاه گیس\",\"type\":\"buy\"},{\"name\":\"چتر\",\"type\":\"buy\"},{\"name\":\"چتر\",\"type\":\"have\"}]},{\"type\":\"yade_hazrat\",\"name\":\"یاد حضرت جهانگرد و جزیره پازونگا\",\"desc\":\"\",\"items\":[]}]', '18:30 تا 18:50 \nمرور سریع قوانین ، سوال درباره اتفاقی که بعد از اینکه هدیه رو دادن به اولیا ری اکشن چی بوده \n\n18:50 تا 19:30 \nداستان جهانگرد و یاد حضرتش\n\n19:30 تا 19:45 پذیرایی \n\n19:45 تا 20:30 \nبازی قل بال', 'Active', '2026-04-29 12:50:05'),
('1767382851613', '1404/10/03', 'جلسه هشتم میزبان علی مجردی', 'low', '[{\"type\":\"game\",\"name\":\"تیر و سپر \",\"desc\":\"\",\"items\":[{\"name\":\"زوبین\",\"type\":\"have\"},{\"name\":\"لیوان\",\"type\":\"have\"},{\"name\":\"توپ\",\"type\":\"have\"}]},{\"type\":\"yade_hazrat\",\"name\":\"یاد حضرت بازی سپر \",\"desc\":\"\",\"items\":[]},{\"type\":\"story\",\"name\":\"داستان مرد اصفهانی و امام هادی علیه السلام\",\"desc\":\"به مناسبت شهادت حضرت امام هادی علی السلام\",\"items\":[]}]', '۱۸:۳۰ تا ۱۸:۵۰ تجمیع \nپرسش درباره شغل اینده بچه ها و دعا\n\n۱۸:۵۰ تا ۱۹:۴۵ بازی سپر و یاد حضرتش\n\n۱۹:۴۵ تا ۲۰:۱۵ داستان مرد اصفهانی و امام هادی علیه السلام \n\n۲۰:۱۵ تا ۲۰:۳۰ پذیرایی', 'Active', '2026-04-29 12:50:05'),
('1767383052193', '1404/10/10', 'جلسه نهم میزبان مهدیار شکوری', 'low', '[{\"type\":\"game\",\"name\":\"جرثقیل بادکنکی\",\"desc\":\"\",\"items\":[{\"name\":\"بادکنک\",\"type\":\"have\"},{\"name\":\"لیوان\",\"type\":\"have\"}]},{\"type\":\"yade_hazrat\",\"name\":\"سلام \",\"desc\":\"\",\"items\":[{\"name\":\"پرینت کاغذش\",\"type\":\"buy\"}]},{\"type\":\"story\",\"name\":\"قسمت اول عماد الدین بازرگان\",\"desc\":\"\",\"items\":[{\"name\":\"لباس پاره\",\"type\":\"have\"},{\"name\":\"سنگ پا\",\"type\":\"have\"},{\"name\":\"کیف به عنوان اسب طلایی\",\"type\":\"have\"}]}]', '18:30 تا 18:50\nاومدن بچه ها دعا و انچه گذشت\n\n18:50تا 19:15 \nیاد حضرت سلام و بازیش\n\n19:15 تا 19:45 \nداستان عماد الدین \n\n19:45 تا 20\nپذیرایی\n\n20 تا 20:30 \nبازی', 'Active', '2026-04-29 12:50:05'),
('1767779719716', '1404/10/17', 'جلسه دهم منزل مهدیار خاطریان', 'low', '[{\"type\":\"game\",\"name\":\"بازی یادحضرت طاووس\",\"desc\":\"لوازم برای نشون دادن عکس ها \",\"items\":[{\"name\":\"لبتاب\",\"type\":\"have\"},{\"name\":\"hdmi\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"ابزار ها (محتوای روز پدر)\",\"desc\":\"\",\"items\":[{\"name\":\"پتو\",\"type\":\"buy\"},{\"name\":\"لامپ شارژی\",\"type\":\"have\"},{\"name\":\"لیوان پلاستیکی و کیسه فریزر\",\"type\":\"buy\"}]},{\"type\":\"yade_hazrat\",\"name\":\"یادحضرت طاووس\",\"desc\":\"\",\"items\":[]},{\"type\":\"other\",\"name\":\"هدیه روز پدر ابزار ها( جعبه ابزار)\",\"desc\":\"\",\"items\":[{\"name\":\"پرینت کاغذ ها\",\"type\":\"have\"},{\"name\":\"قیچی و چسب\",\"type\":\"have\"}]}]', '18:30 تا 18:45\n شروع بازی مخصوص این خونه\n\n18:45 تا 18:50 \nدعا\n\n18:50 تا 19:15 \nبازی یادحضرت طاووس\n\n19:15 تا 19:25 \nیادحضرت طاووس\n\n19:25 تا 19:35\nپذیرایی\n\n19:35 تا 19:50 \nنمایش ابزار ها\n\n19:50 تا 20:30 \nدرست کردن کاردستی', 'Active', '2026-04-29 12:50:05'),
('1769118889922', '1404/11/01', 'جلسه یازدهم خونه سجاد', 'low', '[{\"type\":\"game\",\"name\":\"مهره تاور \",\"desc\":\"\",\"items\":[{\"name\":\"مهره\",\"type\":\"have\"},{\"name\":\"سیخ کباب\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"داستان انگیزشی نیمه شعبان حضرت یوسف\",\"desc\":\"\",\"items\":[]}]', '18:30 تا 18:45\n شروع بازی مخصوص این خونه\n\n18:45 تا 18:50 \nدعا\n\n18:50 تا 19:20\nبازی مهره تاور\n\n19:15 تا 19:45\nداستان انگیزشی1\n\n19:45 تا 20\nپذیرایی و یاد حضرت\n\n20 تا 20:30\nصحبت درباره جشن و مسئولیت ها', 'Active', '2026-04-29 12:50:05'),
('1769494545218', '1404/11/08', 'جلسه دوازدهم خونه محمدمهدی', 'high', '[{\"type\":\"game\",\"name\":\"تورنادو\",\"desc\":\"\",\"items\":[{\"name\":\"چسب کاغذی\",\"type\":\"buy\"}]},{\"type\":\"story\",\"name\":\"داستان انگیزشی ۱\",\"desc\":\"\",\"items\":[]},{\"type\":\"other\",\"name\":\"برگه صله مراسم نیمه شعبان برای اولیا\",\"desc\":\"\",\"items\":[]}]', '۱۸:۳۰ تا ۱۸:۴۵ \nبازی این خونه هوپ\n\n۱۸:۴۵ تا ۱۸:۵۰ \nدعا و شروع \n\n۱۸:۵۰ تا ۱۹:۲۰ \nبازی تورنادو\n\n۱۹:۲۰ تا ۱۹:۵۰ \nداستان انگیزشی ۱\n\n۱۹:۵۰ تا ۲۰:۳۰ \nپذیرایی و صحبت درباره نیمه و مسئولیت ها', 'Active', '2026-04-29 12:50:05'),
('1770138550217', '1404/11/14', 'اردو', 'low', '[{\"type\":\"trip\",\"name\":\"جشن پشت خطی های دبستان صدف\",\"desc\":\"\",\"items\":[]}]', '۱۶:۳۰ تا ۱۹', 'Active', '2026-04-29 12:50:05'),
('1770446973004', '1404/11/17', 'جشن کلاسی بچه ها', 'low', '[{\"type\":\"yade_hazrat\",\"name\":\"مهمونی پادشاه مناسب جشن\",\"desc\":\"\",\"items\":[]},{\"type\":\"yade_hazrat\",\"name\":\"ذوالقرنین و غار تاریک\",\"desc\":\"\",\"items\":[]},{\"type\":\"yade_hazrat\",\"name\":\"نبود صاحب اصلی جشن و عدد بزرگ رویه شمع\",\"desc\":\"\",\"items\":[]}]', '۹ تا ۱۶:۳۰ اماده سازی \n ۱۷ تا ۲۰ جشن\n۲۰:۳۰ تا ۲۲ جمع اوری', 'Active', '2026-04-29 12:50:05'),
('1771448422365', '1404/11/29', 'جلسه سیزدهم', 'low', '[{\"type\":\"game\",\"name\":\"فلش( قاپر)\",\"desc\":\"\",\"items\":[{\"name\":\"توپ\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"قسمت دوم عمادالدین بازرگان \",\"desc\":\"\",\"items\":[{\"name\":\"تاج\",\"type\":\"buy\"},{\"name\":\"چادر برای شنل\",\"type\":\"buy\"}]},{\"type\":\"yade_hazrat\",\"name\":\"شروع ماه رمضان و هدیه روضه به امام زمان\",\"desc\":\"توضیح خلاصه ای از ماه رمضون و چندین برابر شدن ثواب ها و در قل و زنجیر بودن شیطان\",\"items\":[]}]', '۱۸:۳۰ تا ۱۸:۴۵ دعا و بازی اول این خونه( گل یا پوچ)\n\n۱۸:۴۵ تا ۱۹:۰۰ \nنقد جشن و جوایز\n\n۱۹ تا ۱۹:۳۰ \nقسمت دوم عماد الدین\n\n۱۹:۳۰ تا ۱۹:۴۵ پذیرایی\n\n۱۹:۴۵ تا ۲۰:۱۵ بازی\n\n۲۰:۱۵ تا ۲۰:۳۰ محتوای ماه رمضون', 'Active', '2026-04-29 12:50:05'),
('1771680896447', '1404/12/01', 'اردو اول سالن فوتبال', 'low', '[{\"type\":\"trip\",\"name\":\"سالن شهرستانی \",\"desc\":\"\",\"items\":[]}]', 'ساعت ۲۰ الی ۲۲', 'Active', '2026-04-29 12:50:05'),
('1772048991768', '1404/12/06', 'جلسه چهاردهم', 'low', '[{\"type\":\"game\",\"name\":\"حمل توپ پینگ پنگ با قاشق \",\"desc\":\"باید یک توپ بزارن رویه قاشق و قاشق با دهنشون بگیرن و ببرن\\nزمانی که سرود پخش شد در حد ده ثانیه میتونن توپ هارو با دست حمل بکنن\",\"items\":[{\"name\":\"قاشق\",\"type\":\"have\"},{\"name\":\"توپ پینگ پنگ\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"محتوای سگانه خوابیدن و نفس کشیدن و قران خوندن در ماه رمضون\",\"desc\":\"خوابیدن (پروژه انتقال اجسام در حالت سکون مطلق) جا به جا کردن کوه تو خواب منظوره، تماس با خرس قطبی \\n\\nتند تند نفس کشیدن\\n\\nقران هر یک دور چند روز طول میکشه خوندنش و..\",\"items\":[]}]', '۱۷ تا ۱۷:۱۵ \nجمع شدن بچه ها و بازی دست ها\n\n۱۷:۱۵ تا ۱۷:۳۰ \nماجرای خواب تو ماه رمضون و گریز محتواییش\n\n۱۷:۳۰ تا ۱۷:۴۰\nوضو گرفتن برای نماز \n\n۱۷:۴۰ تا ۱۷:۵۵ نماز\n\n۱۷:۵۵ تا ۱۸:۵۰ افطار\n\n۱۸:۵۰ تا ۱۹ \nمحتوای نفس کشیدن و محتواش\n\n۱۹ تا ۱۹:۴۰ \nبازی حمل توپ با قاشق \n\n\n۱۹:۴۰ تا ۲۰ \nمحتوای قران و ماه رمضون', 'Active', '2026-05-09 11:08:09'),
('1773280072589', '1404/12/20', 'جلسه پونزدهم', 'low', '[{\"type\":\"game\",\"name\":\"بادیگارد\",\"desc\":\"\",\"items\":[{\"name\":\"لیوان\",\"type\":\"have\"},{\"name\":\"توپ پینگ پنگ\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"متاترون\",\"desc\":\"\",\"items\":[{\"name\":\"پاکت نامه\",\"type\":\"have\"},{\"name\":\"پاکت نامه طلایی\",\"type\":\"have\"},{\"name\":\"اسپیکر\",\"type\":\"have\"}]},{\"type\":\"yade_hazrat\",\"name\":\"نوشتن نامه ،شب های قدر\",\"desc\":\"\",\"items\":[{\"name\":\"کاغذ رنگی\",\"type\":\"have\"},{\"name\":\"پاکت نامه\",\"type\":\"have\"},{\"name\":\"خودکار\",\"type\":\"have\"}]}]', '۱۷ تا ۱۷:۳۰ \nدعا و اومدن بچه ها و بازی خونه (دست به دست)\n\n۱۷:۳۰ تا ۱۷:۴۵ \nصحبت درباره امیرالمومنین \n\n۱۷:۴۵ تا ۱۷:۵۵ \nوضو و جای نماز\n\n۱۷:۵۵ تا ۱۸:۴۵ \nنماز و افطار \n\n۱۸:۴۵ تا ۱۹:۱۵ \nبازی بادیگارد \n\n۱۹:۱۵ تا ۱۹:۴۵ \nداستان متاترون \n\n۱۹:۴۵ تا ۲۰\nیادحضرت و نوشتن ارزوها', 'Active', '2026-04-29 12:50:05'),
('1774487307300', '1404/12/27', 'جلسه شونزدهم خونه عماد', 'low', '[{\"type\":\"game\",\"name\":\"منجوان\",\"desc\":\"\",\"items\":[{\"name\":\"منجنیق\",\"type\":\"have\"},{\"name\":\"لیوان\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"زنگوله طلایی\",\"desc\":\"\",\"items\":[{\"name\":\"زنگوله\",\"type\":\"have\"}]},{\"type\":\"yade_hazrat\",\"name\":\"یادحضرت زنگوله طلایی \",\"desc\":\"\",\"items\":[]},{\"type\":\"other\",\"name\":\"آنچه در سال ۱۴۰۵ خواهید دید\",\"desc\":\"\",\"items\":[{\"name\":\"ساخت پاورپوینت اتفاقات سال جدید\",\"type\":\"have\"},{\"name\":\"ساخت عکس\",\"type\":\"have\"}]}]', '۱۷ تا ۱۷:۴۵ \nدعا و بازی منجنیق\n\n۱۷:۴۵ تا ۱۷:۵۵ \nوضو و جای نماز و صحبت درباره نکته نماز\nو صحبت درباره روز اخر ماه رمضون \n\n۱۸ تا ۱۹\nنماز و افطار \n\n۱۹ تا ۱۹:۳۰\nداستان زنگوله\n\n۱۹:۳۰ تا ۱۹:۴۰ \nیادحضرت \n\n۱۹:۴۰ تا ۲۰\nانچه در سال اینده خواهید دید', 'Active', '2026-05-09 11:09:48'),
('1775699763022', '1405/01/19', 'جلسه هفتهم میزبانی علی', 'low', '[{\"type\":\"game\",\"name\":\"موشک\",\"desc\":\"\",\"items\":[{\"name\":\"کاغذ اچار\",\"type\":\"have\"}]},{\"type\":\"yade_hazrat\",\"name\":\"یادحضرت موشک \",\"desc\":\"\",\"items\":[]}]', '۱۸ الی  ۱۸:۲۰ \nدعا و بازی اول «شایعه» «زمان»\n\n۱۸:۳۰ الی ۱۸/۴۵ \nنکته نماز«خم شدن رکوع » «زمان»\n\n۱۸/۴۵ الی ۱۹/۲۰ \nبازی موشک و ساخت موشک«بهمن»\n\n۱۹/۲۰ الی ۱۹/۳۵ \nپذیرایی و نفر اول پرهام «زمان» \n\n۱۹/۳۵ الی ۱۹/۵۰ \nیادحضرت ثقلین «بهمن»\n\n۱۹/۵۰ الی ۲۰ \nاعلام اردو بوکا «قانع»', 'Active', '2026-04-29 12:50:05'),
('1775804794334', '1405/01/21', 'اردو دوم سالن بوکا اقای حیدری', 'low', '[{\"type\":\"trip\",\"name\":\"سالن بوکا اقای حیدری\",\"desc\":\"\",\"items\":[]}]', '18:45 تا 19 تجمیع\n19 تا 21 سالن و پذیرایی', 'Active', '2026-04-29 12:50:05'),
('1776459045185', '1405/01/26', 'جلسه هجدهم منزل سجاد', 'low', '[{\"type\":\"game\",\"name\":\"دو دوز\",\"desc\":\"\",\"items\":[{\"name\":\"طلق دوز\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"داستان دانیال جعفرپور(کمک کردن)\",\"desc\":\"\",\"items\":[{\"name\":\"اکسسوری های نمایش\",\"type\":\"have\"}]},{\"type\":\"yade_hazrat\",\"name\":\"یاد حضرت داستان دانیال جعفرپور و داستان امام صادق علیه السلام\",\"desc\":\"\",\"items\":[]}]', '۶ تا ۶:۱۵ اومدن بچه ها و سنگد کاغذ قیچی گروهی\n۶:۱۵ تا ۶:۴۵ نماز جماعت و نکته نماز الیاس(زودتر از امام جماعت کاری نکنیم)\n۶:۴۵ تا ۷:۱۵\nداستان کمک و یادحضرتش \n۷:۱۵ تا ۷:۳۰ پذیرایی\n۷:۳۰ تا ۸ بازی دو دوز', 'Active', '2026-04-29 12:50:05'),
('1777483027796', '1405/02/02', 'جلسه نوزندهم منزل ابوالفضل', 'low', '[{\"type\":\"game\",\"name\":\"فوت بال فووتی\",\"desc\":\"\",\"items\":[{\"name\":\"توپ پینگ پنگ\",\"type\":\"have\"},{\"name\":\"دروازه کوچیک\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"محله تاریک\",\"desc\":\"\",\"items\":[{\"name\":\"ریش و کلاه گیس\",\"type\":\"have\"},{\"name\":\"شال برای بستن صورت\",\"type\":\"have\"},{\"name\":\"اسپیکر\",\"type\":\"have\"},{\"name\":\"ویس شب و روز\",\"type\":\"have\"}]}]', '۶ تا ۶:۱۰\nاومدن بچه ها و بازی فووت مال\n\n۶:۱۰ الی ۶:۲۵\nقسمت اول و پیرمردا\n\n۶/۲۵ تا ۷\nنماز جماعت و نکات نماز\n\n۷ تا ۷:۳۰\nجلسه اول خرابکاری / خرابکاری\n\n۷:۳۰ تا ۸\nپذیرایی و فوتبال فووتی', 'Active', '2026-05-06 19:52:08'),
('1777484119061', '1405/02/09', 'جلسه بیستم منزل محمد', 'low', '[{\"type\":\"game\",\"name\":\"رئیس بازی \",\"desc\":\"\",\"items\":[]},{\"type\":\"other\",\"name\":\"محتوای مناسبتی ولادت امام رضا علیه السلام همسایه ها\",\"desc\":\"\",\"items\":[{\"name\":\"پرینت خانه ها\",\"type\":\"have\"},{\"name\":\"پاورپوینت\",\"type\":\"have\"}]}]', '۰۶:۰۰ تا ۰۶:۱۰ | چشم تو چشم و دعا\n۰۶:۱۰ تا ۰۶:۴۰ | رئیس بازی\n۰۶:۴۰ تا ۰۷:۰۰ | نماز\n۰۷:۰۰ تا ۰۷:۱۵ | پذیرایی و معرفی اولیه\n۰۷:۱۵ تا ۰۸:۰۰ | همسایه ها', 'Active', '2026-04-29 17:35:19'),
('1777744913355', '1405/02/16', 'جلسه بیست و یکم منزل مهدیار شکوری', 'low', '[{\"type\":\"game\",\"name\":\"گالاب\",\"desc\":\"\",\"items\":[{\"name\":\"لیوان یک بار مصرف\",\"type\":\"have\"},{\"name\":\"توپ پینگ پنگ\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"هرکس به اندازه خودش(قسمت اول عنکبوت و مورچه)\",\"desc\":\"\",\"items\":[{\"name\":\"صندوق چه باشگاه قهرمانان کوچک\",\"type\":\"have\"}]},{\"type\":\"yade_hazrat\",\"name\":\"یادحضرت هرکس به اندازه خودش\",\"desc\":\"\",\"items\":[]}]', '۰۶:۰۰ تا ۰۶:۲۰ | قایم‌جسمک و دعا\n۰۶:۲۰ تا ۰۶:۴۰ | داستان عنکبوت\n۰۶:۴۰ تا ۰۷:۰۰ | نماز\n۰۷:۰۰ تا ۰۷:۱۵ | پذیرایی\n۰۷:۱۵ تا ۰۷:۴۵ | بازی اسم‌فامیل\n۰۷:۴۵ تا ۰۸:۰۰ | داستان مورچه', 'Active', '2026-05-06 19:50:59'),
('1778770620691', '1405/02/23', 'جلسه ۲۲م منزل مهدیار خاطریان', 'low', '[{\"type\":\"story\",\"name\":\"قسمت دوم هرکس به اندازه خودش داستان قورباغه و مورچه\",\"desc\":\"\",\"items\":[]},{\"type\":\"game\",\"name\":\"تیلارت\",\"desc\":\"کارت های قدرت رویه زمین\\nاینطوریه که اگر گوی از رویه اون کارت رد بشه قدرتش فعال میشه\\nضبدردو: بعد از این گوی تو هر استوانه تی بره امتیازش دو برابر میشه\\nشلیک اضافه:هر کس تو راند دو شلیک داره، وقتی از رویه این کارت رد بشه یک شلیک اضافه تر تو اون راند داره\\nپرش برق اسا:اگر این کارت فعال بشه فرد زننده بلند میشه از جاش و میره جلو تر تا فاصلش نصف بشه با اهداف\\nهدف انتخابی: اگر بعد از فعال شدن این کارت گوی بره داخله یک برج میتونن انتخاب بکنن که امتیاز برج بزرگ بیشتر رو بگیرن\\nجمع امتیاز: اخر راند اگر امتیازی گرفته بودن بها ازای هر برج +۲ میخورن \\n\\nکارت های قرمز تاثیر منفی برای تیم حریف داره\\n\\nتیر لرزان: حرف اون راند باید با چشم بسته شلیک بکنه\\nیخ زدگی نوبت:حریف تو اون راند یک نوبتش میسوزه و نمیتونه شلیک بکنه\\nکم کردن امتیاز:\\nدو امتیاز از حریف کم میشه\",\"items\":[{\"name\":\"پرینت کارت های ابیلیتی مسیر\",\"type\":\"have\"},{\"name\":\"استوانه های امتیاز\",\"type\":\"have\"},{\"name\":\"تیله ها در دو رنگ\",\"type\":\"have\"}]}]', '۰۶:۰۰ تا ۰۶:۲۰ | کشتی‌انگشتی (م.ز) و دعا\n۰۶:۲۰ تا ۰۶:۵۰ | داستان ها (م.ز-ا.ب) + یاد حضرت (ا.ق)\n۰۶:۵۰ تا ۰۷:۱۰ | نماز و نکته (م.ز) (چیزی خوردن)\n۰۷:۱۰ تا ۰۷:۳۰ | تیلارت + پذیرایی (ا.ق)\n۰۷:۳۰ تا ۰۸:۰۰ | مدیریت جشن غدیر (ا.ب)', 'Active', '2026-05-14 14:57:00'),
('1779341642319', '1405/02/30', 'جلسه ۲۳م خونه محمدمهدی', 'low', '[{\"type\":\"game\",\"name\":\"گرا پنالتی\",\"desc\":\"\",\"items\":[{\"name\":\"توپ\",\"type\":\"have\"}]},{\"type\":\"other\",\"name\":\"برگه های صله و مهمان ها\",\"desc\":\"\",\"items\":[{\"name\":\"پرینت\",\"type\":\"have\"}]}]', '۰۶:۰۰ تا ۰۶:۲۰ | چالش ارتفاع و دعا\n۰۶:۲۰ تا ۰۶:۵۰ | پیگیری های غدیر و توضیحات برگه صله و مهمان\n۰۶:۵۰ تا ۰۷:۱۰ | نماز و نکته\n۰۷:۱۰ تا ۰۷:۴۰ | پذیرایی و مسئولیت ها\n۰۷:۴۰ تا ۰۸:۰۰ | گرا پنالت', 'Active', '2026-05-21 05:34:02'),
('1779951721414', '1405/03/06', 'جلسه۲۴م خونه امیرعلی', 'low', '[{\"type\":\"game\",\"name\":\"نقطه زن\",\"desc\":\"\",\"items\":[{\"name\":\"برد نقطه زن\",\"type\":\"have\"},{\"name\":\"دارت\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"لوطی ها قسمت اول\",\"desc\":\"\",\"items\":[]},{\"type\":\"yade_hazrat\",\"name\":\"یاد حضرت امام محمد باقر علیه السلام ۹ تیر داخل هم\",\"desc\":\"\",\"items\":[]}]', '۰۶:۰۰ تا ۰۶:۲۰ | (گل یا پوچ) و دعا\n۰۶:۲۰ تا ۰۶:۵۰ | بازی نقطه زن\n۶:۵۰ تا ۰۷:۰۰ | نیمه اول داستان لوطی ها قسمت اول\n۰۷:۰۰ تا ۰۷:۱۵| نماز\n۰۷:۱۵ تا ۰۷:۲۵ |نیمه دوم داستان لوطی ها\n۰۷:۲۵ تا ۰۷:۳۵ | پذیرایی\n۰۷:۳۵ تا ۷:۵۰ | یادحضرت\n۰۷:۵۰ تا ۰۸:۰۰ | صحبت گروه های جشنی با هم', 'Active', '2026-05-28 07:02:01'),
('1781718073830', '1405/03/27', 'جلسه ۲۵م میزبان عماد بام لانژ ', 'low', '[{\"type\":\"game\",\"name\":\"حدس پرچم ها\",\"desc\":\"\",\"items\":[{\"name\":\"پاورپوینت\",\"type\":\"have\"}]},{\"type\":\"other\",\"name\":\"محتوای پرچم و شروع ماه محرم و قول دادن برای مشکی پوشیدن\",\"desc\":\"\",\"items\":[]},{\"type\":\"yade_hazrat\",\"name\":\"پرچم \",\"desc\":\"\",\"items\":[]}]', 'سین جلسه ۲۷ خرداد\n\n۶ تا ۶:۱۵ \nاومدن بچه ها و زیارت عاشورا\n\n۶:۱۵ تا ۷ \nمحتوای پرچم\n \n۷ تا ۷:۳۰ \nنماز جماعت و خوندن نماز بعد روضه\n \n۷:۳۰ تا ۸ \nپذیرایی و ساخت کشتی تا جلسه بعدی', 'Active', '2026-06-17 17:41:13'),
('1782937874841', '1405/04/10', 'جلسه ۲۶م منزل پرهام رجبی پور', 'low', '[{\"type\":\"game\",\"name\":\"رالی انفرادی کشتی ها\",\"desc\":\"\",\"items\":[{\"name\":\"چوب و دوک\",\"type\":\"have\"},{\"name\":\"نخ کاموا\",\"type\":\"have\"},{\"name\":\"پرینت عکس ها\",\"type\":\"have\"}]},{\"type\":\"story\",\"name\":\"اتش نشان ها و ارزش اشک امام حسین علیه السلام\",\"desc\":\"🟢اتش نشان اول :«الیاس»\\nچوخولوسفکلفسکی \\nقابلیت خاموش کردن اتیش با یک کپسول\\n\\n\\n🔴اتش نشان دوم :«محمد مهدی »\\nجک جونیور. از انگلستان\\nانکلیسی زبان\\nقابلیت خاموش کردن یک جنگل با ماشبن اتش نشانی\\n\\n\\n🟢اتیش نشان سوم\\nاستاد شیلنگ فو\\nاز شرق اسیا \\n\\nادعا داره با انرژی خوابش اتیش خجالت میکشه و خاموش میشه\\nوقتی اعزام میشن \\nبقیه اتیش نشان ها اب میریزن رویه اتیش ولی این میره یک گوشه میخوابه تا با انرژی ارامش خوابش اتیش رو خاموش کنه و فکر میکنه واقعا اینطوری اتیش خاموش میشه\\n\\n\\n\\n🔴اتش نشان چهارم:«محمد مهدی»\\nپرفسور \\nرشته مواد شیمیایی\\nیک ماده که خاموش کردن کل اتیش با یک قطره از این ماده\",\"items\":[{\"name\":\"شلنگ\",\"type\":\"have\"},{\"name\":\"بالشت\",\"type\":\"have\"},{\"name\":\"اکسسوری های نمایش\",\"type\":\"have\"}]}]', 'سین جلسه ۲۷ خرداد\n\n۶ تا ۶:۱۵ \nاومدن بچه ها و زیارت عاشورا\n\n۶:۱۵ تا ۶:۴۰\nبازی سوال ها\n\n۶:۴۰ تا ۷:۱۵\nداستان اتش نشان\n \n۷:۱۵ تا ۷:۴۰ \nنماز جماعت و خوندن نماز جماعت\n\n۷:۴۰ تا ۸ \nپذیرایی بازی کشترول\n', 'Active', '2026-07-01 20:31:14');

-- --------------------------------------------------------

--
-- Table structure for table `plan_files`
--

CREATE TABLE `plan_files` (
  `id` int(11) NOT NULL,
  `plan_id` varchar(40) NOT NULL,
  `original_name` varchar(255) NOT NULL,
  `stored_path` text NOT NULL,
  `mime_type` varchar(120) DEFAULT NULL,
  `file_size` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `plan_files`
--

INSERT INTO `plan_files` (`id`, `plan_id`, `original_name`, `stored_path`, `mime_type`, `file_size`, `created_at`) VALUES
(1, '1777484119061', 'همسایه ها.pptx', 'uploads/plans/1777484119061/1777484133_c78b004e.pptx', 'application/vnd.openxmlformats-officedocument.presentationml.presentation', 5458378, '2026-04-29 17:35:33'),
(2, '1777484119061', 'پلاک 71.png', 'uploads/plans/1777484119061/1777548951_e80f0245.png', 'image/png', 960968, '2026-04-30 11:35:51'),
(3, '1777484119061', 'پلاک 94.png', 'uploads/plans/1777484119061/1777548951_1486eb96.png', 'image/png', 1459910, '2026-04-30 11:35:51'),
(4, '1777484119061', 'پلاک 117.png', 'uploads/plans/1777484119061/1777548951_3dd31454.png', 'image/png', 1524707, '2026-04-30 11:35:51'),
(5, '1777484119061', 'پلاک 134.png', 'uploads/plans/1777484119061/1777548951_90371e66.png', 'image/png', 1491244, '2026-04-30 11:35:51'),
(6, '1777484119061', 'پلاک 146.png', 'uploads/plans/1777484119061/1777548951_77e51cc4.png', 'image/png', 1569634, '2026-04-30 11:35:51'),
(7, '1777484119061', 'پلاک 159.png', 'uploads/plans/1777484119061/1777548951_092ea5ad.png', 'image/png', 1630255, '2026-04-30 11:35:51'),
(8, '1777484119061', 'پلاک 172.png', 'uploads/plans/1777484119061/1777548951_ca7e2b8e.png', 'image/png', 1442797, '2026-04-30 11:35:51'),
(9, '1777484119061', 'پلاک 188.png', 'uploads/plans/1777484119061/1777548951_26de7a3f.png', 'image/png', 1486005, '2026-04-30 11:35:51'),
(10, '1777484119061', 'پلاک 203.png', 'uploads/plans/1777484119061/1777548951_53f881f1.png', 'image/png', 1580579, '2026-04-30 11:35:51'),
(11, '1777484119061', 'پلاک 222.png', 'uploads/plans/1777484119061/1777548951_94b4345e.png', 'image/png', 987322, '2026-04-30 11:35:51'),
(12, '1777484119061', 'پلاک 234.png', 'uploads/plans/1777484119061/1777548951_343bd323.png', 'image/png', 1574366, '2026-04-30 11:35:51'),
(13, '1777484119061', 'پلاک 271.png', 'uploads/plans/1777484119061/1777548951_b7fb7772.png', 'image/png', 904752, '2026-04-30 11:35:51'),
(14, '1777484119061', 'پلاک 276.png', 'uploads/plans/1777484119061/1777548951_a9aa949b.png', 'image/png', 872974, '2026-04-30 11:35:51'),
(15, '1777484119061', 'پلاک 315.png', 'uploads/plans/1777484119061/1777548951_9bcc6581.png', 'image/png', 1336406, '2026-04-30 11:35:51'),
(16, '1777484119061', 'پلاک 383.png', 'uploads/plans/1777484119061/1777548951_17f23c58.png', 'image/png', 1484886, '2026-04-30 11:35:51'),
(17, '1777484119061', 'پلاک 402.png', 'uploads/plans/1777484119061/1777548951_0c2cc8ff.png', 'image/png', 750143, '2026-04-30 11:35:51'),
(18, '1777484119061', 'پلاک12.png', 'uploads/plans/1777484119061/1777548951_cddb5f2a.png', 'image/png', 1456486, '2026-04-30 11:35:51'),
(19, '1777484119061', 'پلاک27.png', 'uploads/plans/1777484119061/1777548951_1727a522.png', 'image/png', 1520178, '2026-04-30 11:35:51'),
(20, '1777484119061', 'پلاک31.png', 'uploads/plans/1777484119061/1777548951_31c30e85.png', 'image/png', 1609695, '2026-04-30 11:35:51'),
(21, '1777484119061', 'پلاک44.png', 'uploads/plans/1777484119061/1777548951_f2ca3e22.png', 'image/png', 1587423, '2026-04-30 11:35:51'),
(22, '1778770620691', ' تیلارت.png', 'uploads/plans/1778770620691/1778770764_2d2a030a.png', 'image/png', 7073266, '2026-05-14 14:59:24'),
(23, '1779341642319', '1494917e-d0d0-4f37-aff0-28c7f0e0a4d0.png', 'uploads/plans/1779341642319/1779341669_33fe08e8.png', 'image/png', 1196983, '2026-05-21 05:34:29'),
(24, '1779341642319', '87fdaa4b-9198-4855-8f0f-f5cd311b48b9.png', 'uploads/plans/1779341642319/1779341669_48be9ce9.png', 'image/png', 746520, '2026-05-21 05:34:29');

-- --------------------------------------------------------

--
-- Table structure for table `settings`
--

CREATE TABLE `settings` (
  `key` varchar(100) NOT NULL,
  `value` text DEFAULT NULL,
  `description` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `settings`
--

INSERT INTO `settings` (`key`, `value`, `description`) VALUES
('ADMIN_CHAT_IDS', '۵۴۹۰۵۰۸۰۹۰', 'آیدی مدیران تلگرام'),
('BOT_TOKEN', '8143901307:AAGqJgpJJgHq-70hDLj5baOwOWBY9OLhPD0', 'توکن ربات تلگرام'),
('SCHEMA_VERSION', '3', 'نسخه ساختار دیتابیس'),
('TG_NOTIFY_ATTENDANCE', '1', 'اعلان حضور'),
('TG_NOTIFY_PURCHASE', '1', 'اعلان خرید'),
('TG_NOTIFY_SCORE', '1', 'اعلان امتیاز');

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `id` int(11) NOT NULL,
  `name` varchar(190) NOT NULL,
  `absences` int(11) NOT NULL DEFAULT 0,
  `late_count` int(11) NOT NULL DEFAULT 0,
  `score` decimal(10,2) NOT NULL DEFAULT 0.00,
  `status` varchar(100) NOT NULL DEFAULT 'ثبت نام',
  `image` text DEFAULT NULL,
  `manual_score` decimal(10,2) NOT NULL DEFAULT 0.00,
  `bio` text DEFAULT NULL,
  `phones` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL CHECK (json_valid(`phones`)),
  `parent_phone` varchar(100) DEFAULT NULL,
  `dob` varchar(50) DEFAULT NULL,
  `school` varchar(190) DEFAULT NULL,
  `medical` text DEFAULT NULL,
  `parent_note` text DEFAULT NULL,
  `late_minutes` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`id`, `name`, `absences`, `late_count`, `score`, `status`, `image`, `manual_score`, `bio`, `phones`, `parent_phone`, `dob`, `school`, `medical`, `parent_note`, `late_minutes`, `created_at`) VALUES
(1, 'مهدیار شکوری', 3, 10, 22.00, 'حاضر', 'uploads/students/student_1_1780423368_be488704.png', 0.00, '', '[{\"label\":\"شماره پدر\",\"number\":\"09379375339\"},{\"label\":\"شماره مادر\",\"number\":\"09150015339\"}]', '', '', '', '', '', 137, '2026-04-29 12:50:04'),
(2, 'امیر علی صمدی', 1, 6, 25.00, 'حاضر', 'uploads/students/student_2_1780423301_5a8d786a.png', 0.00, '', '[{\"label\":\"شماره مادر\",\"number\":\"09157366272\"}]', '', '1395/06/15', '', '', '', 76, '2026-04-29 12:50:04'),
(3, 'عماد رضایی', 0, 9, 27.50, 'حاضر', 'uploads/students/student_3_1780423198_04410cca.png', 0.00, '', '[{\"label\":\"شماره پدر\",\"number\":\"09151116444\"},{\"label\":\"شماره مادر\",\"number\":\"09155002550\"},{\"label\":\"شماره برادر(عرفان)\",\"number\":\"09158152550\"}]', '', '1395/04/30', '', '', '', 149, '2026-04-29 12:50:04'),
(4, 'مهدی یار خاطریان', 3, 5, 20.50, 'حاضر', 'uploads/students/student_4_1780423386_ac39ef89.png', 0.00, '', '[{\"label\":\"شماره پدر\",\"number\":\"09154461696\"}]', '', '', '', '', '', 40, '2026-04-29 12:50:04'),
(5, 'علی مجردی', 0, 6, 27.00, 'حاضر', 'uploads/students/student_5_1780423247_b95fe996.png', 0.00, '', '[{\"label\":\"شماره پدر\",\"number\":\"09155081057\"},{\"label\":\"شماره مادر\",\"number\":\"09158608372\"}]', '', '1394/11/27', '', '', '', 41, '2026-04-29 12:50:04'),
(6, 'محمد مهدی امین فر', 0, 7, 26.50, 'حاضر', 'uploads/students/student_6_1780423268_53b3f2f5.png', 0.00, '', '[{\"label\":\"شماره مادر\",\"number\":\"09151240295\"}]', '', '1395/02/09', '', '', '', 51, '2026-04-29 12:50:04'),
(7, 'پرهام رجبی پور', 0, 9, 27.00, 'حاضر', 'uploads/students/student_7_1780423221_8ae917bf.png', 0.00, '', '[{\"label\":\"شماره مادر \",\"number\":\"۰۹۱۵۸۸۳۸۷۴۱\"}]', '', '۱۳۹۴/۰۷/۰۲', '', '', '', 100, '2026-04-29 12:50:04'),
(8, 'محمد صالح میری', 1, 11, 24.00, 'تاخیر (10)', 'uploads/students/student_8_1780423321_56c219f9.png', 0.00, '', '[{\"label\":\"شماره مادر\",\"number\":\"09354853835\"}]', '', '', '', '', '', 171, '2026-04-29 12:50:04'),
(9, 'سجاد فدایی', 1, 4, 19.00, 'ثبت نام', 'uploads/students/student_9_1780423403_57ab6626.png', 0.00, '', '[{\"label\":\"شماره مادر\",\"number\":\"09155585469\"}]', '', '1394/06/30', '', '', '', 40, '2026-04-29 12:50:04'),
(10, 'ابوالفضل مکی', 0, 2, 12.50, 'ثبت نام', 'uploads/students/student_10_1780423455_875294e0.png', 0.00, '', '[]', '', '', '', '', '', 10, '2026-04-29 12:50:04'),
(11, 'محمد مهدوی فر', 4, 2, 5.00, 'ثبت نام', 'uploads/students/student_11_1780427121_0543cb35.png', 0.00, '', '[]', '', '', '', '', '', 25, '2026-04-29 12:50:04'),
(12, 'طاها حسن پور', 1, 4, 7.00, 'ثبت نام', 'uploads/students/student_12_1780427104_cab3dcaa.png', 0.00, '', '[]', '', '', '', '', '', 41, '2026-04-29 12:50:04'),
(14, 'محمد مسعود طحان', 0, 0, 2.00, 'ثبت نام', 'uploads/students/student_14_1782937684_66af0ebe.png', 0.00, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, '2026-06-17 17:42:13');

-- --------------------------------------------------------

--
-- Table structure for table `telegram_queue`
--

CREATE TABLE `telegram_queue` (
  `id` int(11) NOT NULL,
  `payload` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL CHECK (json_valid(`payload`)),
  `status` varchar(20) NOT NULL DEFAULT 'pending',
  `attempts` int(11) NOT NULL DEFAULT 0,
  `last_error` text DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `sent_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `telegram_queue`
--

INSERT INTO `telegram_queue` (`id`, `payload`, `status`, `attempts`, `last_error`, `created_at`, `sent_at`) VALUES
(1, '{\"chat_id\":\"۵۴۹۰۵۰۸۰۹۰\",\"text\":\"<b>📋 ثبت حضور و غیاب<\\/b>\\n<b>────────────────<\\/b>\\nتاریخ: 1405\\/02\\/09\\nحاضر: 8\\nتاخیر: 3\\nغیبت: 1\\nموجه: 0\",\"parse_mode\":\"HTML\",\"disable_web_page_preview\":true}', 'pending', 0, 'ارسال به تلگرام ممکن نشد', '2026-04-29 17:37:59', NULL),
(2, '{\"chat_id\":\"۵۴۹۰۵۰۸۰۹۰\",\"text\":\"<b>📋 ثبت حضور و غیاب<\\/b>\\n<b>────────────────<\\/b>\\nتاریخ: 1405\\/02\\/14\\nحاضر: 9\\nتاخیر: 2\\nغیبت: 1\\nموجه: 0\",\"parse_mode\":\"HTML\",\"disable_web_page_preview\":true}', 'pending', 0, 'ارسال به تلگرام ممکن نشد', '2026-05-01 05:16:52', NULL),
(3, '{\"chat_id\":\"۵۴۹۰۵۰۸۰۹۰\",\"text\":\"<b>📋 ثبت حضور و غیاب<\\/b>\\n<b>────────────────<\\/b>\\nتاریخ: 1405\\/02\\/14\\nحاضر: 11\\nتاخیر: 0\\nغیبت: 1\\nموجه: 0\",\"parse_mode\":\"HTML\",\"disable_web_page_preview\":true}', 'pending', 0, 'ارسال به تلگرام ممکن نشد', '2026-05-01 05:33:34', NULL),
(4, '{\"chat_id\":\"۵۴۹۰۵۰۸۰۹۰\",\"text\":\"<b>📋 ثبت حضور و غیاب<\\/b>\\n<b>────────────────<\\/b>\\nتاریخ: 1405\\/02\\/16\\nحاضر: 8\\nتاخیر: 3\\nغیبت: 1\\nموجه: 0\",\"parse_mode\":\"HTML\",\"disable_web_page_preview\":true}', 'pending', 0, 'ارسال به تلگرام ممکن نشد', '2026-05-06 19:54:20', NULL),
(5, '{\"chat_id\":\"۵۴۹۰۵۰۸۰۹۰\",\"text\":\"<b>📋 ثبت حضور و غیاب<\\/b>\\n<b>────────────────<\\/b>\\nتاریخ: 1405\\/02\\/30\\nحاضر: 7\\nتاخیر: 4\\nغیبت: 1\\nموجه: 0\",\"parse_mode\":\"HTML\",\"disable_web_page_preview\":true}', 'pending', 0, 'ارسال به تلگرام ممکن نشد', '2026-05-21 05:36:23', NULL),
(6, '{\"chat_id\":\"۵۴۹۰۵۰۸۰۹۰\",\"text\":\"<b>📋 ثبت حضور و غیاب<\\/b>\\n<b>────────────────<\\/b>\\nتاریخ: 1405\\/03\\/06\\nحاضر: 8\\nتاخیر: 2\\nغیبت: 2\\nموجه: 0\",\"parse_mode\":\"HTML\",\"disable_web_page_preview\":true}', 'pending', 0, 'ارسال به تلگرام ممکن نشد', '2026-05-28 07:02:59', NULL),
(7, '{\"chat_id\":\"۵۴۹۰۵۰۸۰۹۰\",\"text\":\"<b>📋 ثبت حضور و غیاب<\\/b>\\n<b>────────────────<\\/b>\\nتاریخ: 1405\\/03\\/27\\nحاضر: 9\\nتاخیر: 4\\nغیبت: 0\\nموجه: 0\",\"parse_mode\":\"HTML\",\"disable_web_page_preview\":true}', 'pending', 0, 'ارسال به تلگرام ممکن نشد', '2026-06-17 17:43:58', NULL),
(8, '{\"chat_id\":\"۵۴۹۰۵۰۸۰۹۰\",\"text\":\"<b>📋 ثبت حضور و غیاب<\\/b>\\n<b>────────────────<\\/b>\\nتاریخ: 1405\\/04\\/10\\nحاضر: 9\\nتاخیر: 4\\nغیبت: 0\\nموجه: 0\",\"parse_mode\":\"HTML\",\"disable_web_page_preview\":true}', 'pending', 0, 'ارسال به تلگرام ممکن نشد', '2026-07-01 20:32:08', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `archive_logs`
--
ALTER TABLE `archive_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_archive_date_type` (`log_date`,`log_type`);

--
-- Indexes for table `attendance_records`
--
ALTER TABLE `attendance_records`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_att` (`session_id`,`student_id`),
  ADD KEY `idx_att_student_status` (`student_id`,`status`),
  ADD KEY `idx_att_session_status` (`session_id`,`status`);

--
-- Indexes for table `attendance_sessions`
--
ALTER TABLE `attendance_sessions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `session_date` (`session_date`),
  ADD KEY `idx_att_session_date_id` (`session_date`,`id`);

--
-- Indexes for table `essentials`
--
ALTER TABLE `essentials`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uniq_uid` (`uid`),
  ADD KEY `plan_id` (`plan_id`);

--
-- Indexes for table `mi_config`
--
ALTER TABLE `mi_config`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `type` (`type`);

--
-- Indexes for table `mi_logs`
--
ALTER TABLE `mi_logs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `student_id` (`student_id`),
  ADD KEY `idx_mi_student_date` (`student_id`,`log_date`);

--
-- Indexes for table `notes`
--
ALTER TABLE `notes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `plans`
--
ALTER TABLE `plans`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_plans_date_updated` (`plan_date`,`updated_at`);

--
-- Indexes for table `plan_files`
--
ALTER TABLE `plan_files`
  ADD PRIMARY KEY (`id`),
  ADD KEY `plan_id` (`plan_id`),
  ADD KEY `idx_plan_files_plan_id_id` (`plan_id`,`id`);

--
-- Indexes for table `settings`
--
ALTER TABLE `settings`
  ADD PRIMARY KEY (`key`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Indexes for table `telegram_queue`
--
ALTER TABLE `telegram_queue`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `archive_logs`
--
ALTER TABLE `archive_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `attendance_records`
--
ALTER TABLE `attendance_records`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=324;

--
-- AUTO_INCREMENT for table `attendance_sessions`
--
ALTER TABLE `attendance_sessions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=211;

--
-- AUTO_INCREMENT for table `essentials`
--
ALTER TABLE `essentials`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=88;

--
-- AUTO_INCREMENT for table `mi_config`
--
ALTER TABLE `mi_config`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `mi_logs`
--
ALTER TABLE `mi_logs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=272;

--
-- AUTO_INCREMENT for table `notes`
--
ALTER TABLE `notes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `plan_files`
--
ALTER TABLE `plan_files`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `students`
--
ALTER TABLE `students`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `telegram_queue`
--
ALTER TABLE `telegram_queue`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `attendance_records`
--
ALTER TABLE `attendance_records`
  ADD CONSTRAINT `fk_att_session` FOREIGN KEY (`session_id`) REFERENCES `attendance_sessions` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_att_student` FOREIGN KEY (`student_id`) REFERENCES `students` (`id`) ON DELETE CASCADE;

--
-- Constraints for table `mi_logs`
--
ALTER TABLE `mi_logs`
  ADD CONSTRAINT `fk_mi_student` FOREIGN KEY (`student_id`) REFERENCES `students` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
